
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоГруппеНоменклатурыАктивен",
	Ложь);      
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоГруппеНоменклатуры",
	Неопределено);    
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоТоварнойКатегорииАктивен",
	Ложь);      
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоТоварнойКатегории",
	Неопределено);
	
	//Попытка  
	//	
	//	ОтборПоНоменклатуре = ЭтотОбъект.Параметры.Номенклатура;
	//	
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.НоменклатураГруппаНоменклатуры) Тогда 
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоГруппеНоменклатурыАктивен",
	//		Истина);      
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоГруппеНоменклатуры",
	//		ЭтотОбъект.Параметры.НоменклатураГруппаНоменклатуры);
	//		
	//	КонецЕсли; 
	//	
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория) Тогда 
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоТоварнойКатегорииАктивен",
	//		Истина);      
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоТоварнойКатегории",
	//		ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория);
	//		
	//	КонецЕсли;  
	
	//Исключение
	//	Возврат;	
	//КонецПопытки;   
	
	Если Параметры.Свойство("Номенклатура") Тогда
		НоменклатураРодитель = Параметры.Номенклатура;	
	КонецЕсли;
	
	Если Параметры.Свойство("КатегорияМатериала") Тогда
		КатегорияМатериала = Параметры.КатегорияМатериала;
	КонецЕсли;   
	
	Если Параметры.Свойство("НоменклатураГруппаНоменклатуры") Тогда
		
		ГруппаНоменклатуры = Параметры.НоменклатураГруппаНоменклатуры;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоГруппеНоменклатурыАктивен",
		Истина);      
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоГруппеНоменклатуры",
		Этотобъект.Параметры.НоменклатураГруппаНоменклатуры); 
		
	КонецЕсли; 
	
	Если Параметры.Свойство("НоменклатураТоварнаяКатегория") Тогда
		
		КатегорияМатериала = Параметры.НоменклатураТоварнаяКатегория;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоТоварнойКатегорииАктивен",
		Истина);      
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоТоварнойКатегории",
		ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория);
		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)  
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Номенклатура", НоменклатураРодитель);
	ЗначенияЗаполнения.Вставить("КатегорияМатериала", КатегорияМатериала);
	ЗначенияЗаполнения.Вставить("ГруппаНоменклатуры", ГруппаНоменклатуры);
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ЗначенияЗаполнения.Вставить("Договор", ЭлементОтбора.ПравоеЗначение);		
		КонецЕсли;
	КонецЦикла;

	
	ОткрытьФорму("РегистрСведений.СБ_ПоставщикиПоТоварнымКатегориям.ФормаЗаписи",
	Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
	ЭтаФорма);
	
КонецПроцедуры
