Процедура ПроведениеДрагМеталлов()	
	
	Объект = ЭтотОбъект;
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлыРасход Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);
				
				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		//Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлы Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);
				
				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		
		
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	ПроведениеДрагМеталлов();
	#КонецВставки

	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ПроизводствоБезЗаказаЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры
