
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОграничениеТипа();
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	УстановитьОграничениеТипа();
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипа(УстановитьОграничение = Истина)
	Если УстановитьОграничение 
		И ЗначениеЗаполнено(Объект.Родитель)
		И Объект.Родитель.Предопределенный Тогда
		
		ИмяРодителя = Объект.Родитель.ИмяПредопределенныхДанных;
		ПозицияРазделитель = СтрНайти(ИмяРодителя, "_");
		
		ИмяМетаданных = Лев(ИмяРодителя, ПозицияРазделитель - 1);
		ИмяОбъекта = Сред(ИмяРодителя, ПозицияРазделитель +1, СтрДлина(ИмяРодителя) - ПозицияРазделитель);
		
		Если СтрНачинаетсяС(ИмяМетаданных, "Справочник") Тогда
			ТипСтрокой = "СправочникСсылка." + ИмяОбъекта;
			ЗаголовокЭлемента = Метаданные.Справочники[ИмяОбъекта].Синоним;
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "ПланыВидовРасчетов") Тогда
			ТипСтрокой = "ПланВидовРасчетовСсылка." + ИмяОбъекта;
			ЗаголовокЭлемента = Метаданные.ПланыВидовРасчетов[ИмяОбъекта].Синоним;
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "ПланыВидовХарактеристик") Тогда
			ТипСтрокой = "ПланВидовХарактеристикСсылка." + ИмяОбъекта;
			ЗаголовокЭлемента = Метаданные.ПланыВидовХарактеристик[ИмяОбъекта].Синоним;
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "ПланыОбмена") Тогда
			ТипСтрокой = "ПланОбменаСсылка." + ИмяОбъекта;
			ЗаголовокЭлемента = Метаданные.ПланыОбменов[ИмяОбъекта].Синоним;
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "Строковые") Тогда
			ТипСтрокой = "Строка";
			ЗаголовокЭлемента = "Строка";
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "Строковые") Тогда
			ТипСтрокой = "Строка";
			ЗаголовокЭлемента = "Строка";
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "Числовые") Тогда
			ТипСтрокой = "Число";
			ЗаголовокЭлемента = "Число"; 
		ИначеЕсли СтрНачинаетсяС(ИмяМетаданных, "Дата") Тогда
			ТипСтрокой = "Дата";
			ЗаголовокЭлемента = "Дата";
		КонецЕсли;
		
		ОписаниеТипов = Новый ОписаниеТипов(ТипСтрокой);
		
		Массив = Новый Массив();
		Массив.Добавить(Тип(ТипСтрокой));
		НашеОписание = Новый ОписаниеТипов(Массив);
		
		Элементы.Значение.ОграничениеТипа = НашеОписание;
		Объект.Значение = НашеОписание.ПривестиЗначение(Объект.Значение);
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов(Неопределено);
		ЗаголовокЭлемента = "Значение";
	КонецЕсли;
	
	Элементы.Значение.ОграничениеТипа = ОписаниеТипов;
	Элементы.Значение.Заголовок = ЗаголовокЭлемента;
		
КонецПроцедуры