
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Отправитель) Тогда 
		СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход, Отправитель);
	КонецЕсли;
	
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Получатель) Тогда 
		СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Приход, Получатель);
	КонецЕсли;
	#КонецВставки
	
	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект, РежимЗаписиДокумента.Проведение);
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ДвижениеПродукцииИМатериаловЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ПроведениеДрагМеталлов()
	СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход);	
КонецПроцедуры