&После("ЗаполнитьОбеспечениеПриУстановкеСтатуса") 
Процедура СБ_ЗаполнитьОбеспечениеПриУстановкеСтатуса(ДополнительныеПараметры)
			
	СтатусНачат       = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
	СтатусЗавершен    = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;

	Попытка
		Если ЭтотОбъект.Статус = СтатусЗавершен ИЛИ ЭтотОбъект.Статус = СтатусНачат Тогда 
			Сч = 0;
			Для Каждого стрр из ЭтотОбъект.ОбеспечениеМатериаламиИРаботами цикл  
				Если стрр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда	 
					Если ПроверкаУчетаСерийМатериалов(стрр)и не ЗначениеЗаполнено(стрр.Серия) Тогда
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
							|	ТоварыНаСкладахОстатки.Серия КАК Серия
							|ПОМЕСТИТЬ ВТ
							|ИЗ
							|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
							|ГДЕ
							|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
							|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика
							|	И ТоварыНаСкладахОстатки.Назначение = &Назначение
							|	И ТоварыНаСкладахОстатки.Склад = &Склад
							|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТоварыНаСкладах.Период КАК Период,
							|	СУММА(ЕСТЬNULL(ВТ.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
							|	МИНИМУМ(ВТ.Серия) КАК Серия,
							|	СУММА(ЕСТЬNULL(ТоварыНаСкладах.ВНаличии, 0)) КАК ВНаличииПришло
							|ИЗ
							|	ВТ КАК ВТ
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
							|		ПО ВТ.Серия = ТоварыНаСкладах.Серия
							|ГДЕ
							|	ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
							|	И ТоварыНаСкладах.Номенклатура = &Номенклатура
							|	И ТоварыНаСкладах.Характеристика = &Характеристика
							|	И ТоварыНаСкладах.Назначение = &Назначение
							|	И ТоварыНаСкладах.Склад = &Склад
							|	И ТоварыНаСкладах.ВНаличии > 0
							|
							|СГРУППИРОВАТЬ ПО
							|	ТоварыНаСкладах.Период
							|
							|УПОРЯДОЧИТЬ ПО
							|	Период";
							
							Запрос.УстановитьПараметр("Назначение", ?(стрр.Обособленно,стрр.Назначение,Справочники.Назначения.ПустаяСсылка()));
							Запрос.УстановитьПараметр("Номенклатура", стрр.Номенклатура);
							Запрос.УстановитьПараметр("Склад", стрр.Склад);
							Запрос.УстановитьПараметр("Характеристика", стрр.Характеристика);
							
							РезультатЗапроса = Запрос.Выполнить().Выбрать();
							КоличествоОбщее = стрр.Количество;
							КОличествоСтарт = стрр.Количество; 

							Пока РезультатЗапроса.Следующий() и  КоличествоОбщее <>0 Цикл  
								Если КоличествоОбщее<>КОличествоСтарт Тогда  
									КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
									МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);  
									СтрОб = ЭтотОбъект.ОбеспечениеМатериаламиИРаботами.Вставить(Сч);
									//Добавить();
									ЗаполнитьЗначенияСвойств(СтрОб,стрр,,"ИдентификаторСтроки,КлючНоменклатура");
									СтрОб.Серия = РезультатЗапроса. Серия ;
									СтрОб.КоличествоУпаковок=МинКол;  
									СтрОб.Количество=МинКол;
									СтрОб.СтатусУказанияСерий = 4;  
									СтрОб.СтатусУказанияСерийОтправитель = 4;

									КоличествоОбщее = КоличествоОбщее - МинКол; 
								Иначе 
									КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
									МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);
									стрр.Серия = РезультатЗапроса. Серия ;
									стрр.КоличествоУпаковок=МинКол; 
									стрр.Количество=МинКол;
									стрр.СтатусУказанияСерий = 4;  
									стрр.СтатусУказанияСерийОтправитель = 4;

									КоличествоОбщее = КоличествоОбщее - МинКол; 
								КонецЕсли;
							КонецЦикла;	
						КонецЕсли;
					КонецЕсли;
					Сч = Сч+1;
					КонецЦикла;	
				КонецЕсли;
				
		Исключение
					
		КонецПопытки;
	
КонецПроцедуры 

Функция ПроверкаУчетаСерийМатериалов(Строка) 
	
	ВидНоменклатуры    = ?(ЗначениеЗаполнено(Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий),Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий,Строка.Номенклатура.ВидНоменклатуры);  
	Если ВидНоменклатуры.ИспользоватьСерии И ВидНоменклатуры.ПолитикаУчетаСерий.УказыватьПриРасходеМатериалов Тогда 
		Отбор = Новый Структура("Склад",Строка.Склад);
		ПроверкаСклада = ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		Если ПроверкаСклада.Количество()>0 Тогда
			ПолитикаУчетаСерий = ПроверкаСклада[0].ПолитикаУчетаСерий;
		Иначе
			ПолитикаУчетаСерий = ВидНоменклатуры.ПолитикаУчетаСерий; 
		КонецЕсли;
		
		Если ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.СерииНеИспользуются Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;		
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции 

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)

	#Вставка
	СБ_ПроведениеДрагМеталлы();
	#КонецВставки
	
	Если ВыполняетсяПакетноеФормирование() Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов("Проведение");
	ДополнительныеСвойства.Вставить("ПараметрыЗаполненияВидовЗапасов", ПараметрыЗаполнения);
	ДополнительныеСвойства.Вставить("ИспользоватьПриПодготовкеПараметрыЗаполненияВидовЗапасов");

	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = ДополнительныеСвойства;

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);

	ВыполнитьКонтрольПриЗакрытииЭтапа(Отказ);

	ОбновитьСвязанныеДанные(Отказ);

	Если Не Отказ И ЗначениеЗаполнено(ДополнительныеСвойства.ПериодПерезаписиДвижений)
		И НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписьРегистра(
		ДополнительныеСвойства.ПериодПерезаписиДвижений,
		Ссылка,
		Организация);
	КонецЕсли;

	ЭтапПроизводства2_2Локализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры

Процедура СБ_ПроведениеДрагМеталлы()
	
	Объект = ЭтотОбъект;
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлыРасход Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);

				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;     
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		//Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		                                                            
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлы Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);

				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		
		                                                            
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
	
КонецПроцедуры 