
&После("ПриЗаписи")
Процедура СБ_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
       Возврат;
    КонецЕсли;

    АвтоЗаполнениеШтрихкода(ЭтотОбъект);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Основная логика: проверка наличия и создание штрихкода
Процедура АвтоЗаполнениеШтрихкода(ОбъектУпаковка) Экспорт
	
	СсылкаУпаковка = ОбъектУпаковка.Ссылка;
	
    Если ОбъектУпаковка.ЭтоГруппа Тогда
        Возврат;
    КонецЕсли;

    Если СсылкаУпаковка.Пустая() Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
    |ИЗ
    |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
    |ГДЕ
    |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
    |	И ШтрихкодыНоменклатуры.Упаковка = &Упаковка";
    Запрос.УстановитьПараметр("Номенклатура", СсылкаУпаковка.Владелец); 
	Запрос.УстановитьПараметр("Упаковка", СсылкаУпаковка);

    Результат = Запрос.Выполнить();

    Если НЕ Результат.Пустой() Тогда
        Возврат;
    КонецЕсли;

   	Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
	
    ЗаписьРегистра = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
    ЗаписьРегистра.Номенклатура = СсылкаУпаковка.Владелец; // Неверные типы данных: Номенклатура и Наборы упаковок
    ЗаписьРегистра.Штрихкод = Штрихкод;
	ЗаписьРегистра.Упаковка = СсылкаУпаковка;
    
    Попытка
    	ЗаписьРегистра.Записать();  
	Исключение 
		Сообщить("Ошибка записи: " + ОписаниеОшибки());
	КонецПопытки;
    

КонецПроцедуры
