
&ИзменениеИКонтроль("НастроитьВидимостьДоступностьЭлементовОперации")
Процедура SB_НастроитьВидимостьДоступностьЭлементовОперации(Объект, Форма, ПараметрыПодразделения, ПрефиксЭлементов)

	Элементы = Форма.Элементы;
	
	СоответствиеЭлементов = РедакторПроизводственногоПроцессаКлиентСервер.СоответствиеЭлементов(ПрефиксЭлементов);
	#Вставка
	СоответствиеЭлементов.Вставить("SB_ВспомогательнаяОперация", "SB_ВспомогательнаяОперацияПоле");
	#КонецВставки
		
	ДоступностьЭлементов        = Форма[СоответствиеЭлементов.ДоступностьЭлементов];
	ИспользуютсяВариантыНаладки = Форма[СоответствиеЭлементов.ИспользуютсяВариантыНаладки];

	Если НЕ Форма.ТолькоПросмотр Тогда

		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить("НомерОперации");
		МассивЭлементов.Добавить("НомерСледующейОперации");
		МассивЭлементов.Добавить("Участок");
		МассивЭлементов.Добавить("РабочийЦентр");
		МассивЭлементов.Добавить("ВремяШтучное");
		МассивЭлементов.Добавить("ВремяШтучноеЕдИзм");
		МассивЭлементов.Добавить("ВремяПЗ");
		МассивЭлементов.Добавить("ВремяПЗЕдИзм");
		МассивЭлементов.Добавить("Загрузка");
		МассивЭлементов.Добавить("Непрерывная");
		МассивЭлементов.Добавить("ВспомогательныеРабочиеЦентры");
		МассивЭлементов.Добавить("Количество");
		МассивЭлементов.Добавить("ЕдиницаИзмерения");
		МассивЭлементов.Добавить("Контроль");
		МассивЭлементов.Добавить("МожноПовторить");
		МассивЭлементов.Добавить("МожноПропустить");
		МассивЭлементов.Добавить("ВидОперации");
		МассивЭлементов.Добавить("КТО");
		МассивЭлементов.Добавить("ВариантНаладки");
		#Вставка
		МассивЭлементов.Добавить("SB_ВспомогательнаяОперация");
		#КонецВставки

		РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		МассивЭлементов, "ТолькоПросмотр", НЕ ДоступностьЭлементов, СоответствиеЭлементов);

		Элементы[СоответствиеЭлементов.Наименование].КнопкаВыбора = ДоступностьЭлементов;

	КонецЕсли;

	РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	СоответствиеЭлементов.ВариантНаладки, "Доступность", ИспользуютсяВариантыНаладки);

	ВидимостьПараметров = Истина;
	//++ Устарело_Производство21
	ВидимостьПараметров = Форма.ИспользуетсяПроизводство22 И НЕ Форма.ИспользуетсяПроизводство21;
	//-- Устарело_Производство21

	РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	"ГруппаКоличество,ГруппаВыполнение", "Видимость", ВидимостьПараметров, СоответствиеЭлементов);

	#Область ПараметрыПооперационногоПланированияИПроизводственныхУчастков

	Если ПараметрыПодразделения = Неопределено Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Подразделение");
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ПараметрыПодразделения = ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение);
		КонецЕсли;
	КонецЕсли;

	Если ПараметрыПодразделения = Неопределено Тогда

		ВидимостьПараметровПооперационногоПланирования = Истина;
		ВидимостьПараметровПроизводственныхУчастков = Истина;

	Иначе

		ВидимостьПараметровПооперационногоПланирования = (ПараметрыПодразделения.ИспользоватьПооперационноеПланирование
		И НЕ Объект.СодержитТехнологическийПроцесс
		//++ Устарело_Производство21
		И Форма.ИспользуетсяПроизводство22
		ИЛИ ПараметрыПодразделения.УправлениеМаршрутнымиЛистами = Перечисления.УправлениеМаршрутнымиЛистами.ПооперационноеПланирование
		И Форма.ИспользуетсяПроизводство21
		//-- Устарело_Производство21
		);
		ВидимостьПараметровПроизводственныхУчастков = (ПараметрыПодразделения.ИспользоватьУчастки
		ИЛИ (НЕ ПараметрыПодразделения.ИспользоватьУчастки
		И ЗначениеЗаполнено(Объект.Участок))
		);

		Если ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольВыполненияОпераций") Тогда
			РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			СоответствиеЭлементов.Контроль, "Видимость",
			НЕ ПараметрыПодразделения.ИспользоватьПооперационноеПланирование
			ИЛИ Объект.Контроль <> Перечисления.ВариантыКонтроляТехнологическихОпераций.НеТребуется);
		КонецЕсли;

	КонецЕсли;

	РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	"ГруппаПередаточнаяПартия,Непрерывная,СтраницаВспомогательныеРабочиеЦентры",
	"Видимость",
	ВидимостьПараметровПооперационногоПланирования,
	СоответствиеЭлементов);
	РедакторПроизводственногоПроцессаКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	СоответствиеЭлементов.Участок,
	"Видимость",
	ВидимостьПараметровПроизводственныхУчастков);

	#КонецОбласти

	НастроитьВидимостьДоступностьПоРеквизитамРЦ(Форма, СоответствиеЭлементов);

КонецПроцедуры
