
&НаКлиенте
Процедура СБ_КомандаУровенНесоответствияПланПосле(Команда)    
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);
	
	ОткрытьФорму("РегистрСведений.СБ_ИсторияИзмененийПлан.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_КомандаУровенНесоответствияФактПосле(Команда)
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);
	
	ОткрытьФорму("РегистрСведений.СБ_ИсторияИзмененийФакт.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура СБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	УровеньНесоответствия();
	
	ЗаполнитьИсторииИзмененийНаСервере();
	
	ЗаполнитьТоварныеКатегорииПоПоставщикуНаСервере();	
	
КонецПроцедуры   

&НаСервере
Процедура УровеньНесоответствия()

	УровеньНесоответствияПлан = 0;
	Элементы.КомандаУровеньНесоответствияПлан.Заголовок = "Значение не установлено";
	
	УровеньНесоответствияФакт = 0;
	Элементы.КомандаУровеньНесоответствияФакт.Заголовок = "Значение не установлено";
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СБ_ИсторияИзмененийПлан.Период КАК Период,
	|	СБ_ИсторияИзмененийПлан.ПланНаГод КАК ПланНаГод
	|ИЗ
	|	РегистрСведений.СБ_ИсторияИзмененийПлан КАК СБ_ИсторияИзмененийПлан
	|ГДЕ
	|	СБ_ИсторияИзмененийПлан.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УровеньНесоответствияПлан = Выборка.ПланНаГод;
		Элементы.КомандаУровеньНесоответствияПлан.Заголовок = "Установлен с " + Формат(Выборка.Период, "ДЛФ=Д");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СБ_ИсторияИзмененийФакт.Период КАК Период,
	|	СБ_ИсторияИзмененийФакт.ПланНаГод КАК ПланНаГод,
	|	СБ_ИсторияИзмененийФакт.ОценкаПоставщика КАК ОценкаПоставщика
	|ИЗ
	|	РегистрСведений.СБ_ИсторияИзмененийФакт КАК СБ_ИсторияИзмененийФакт
	|ГДЕ
	|	СБ_ИсторияИзмененийФакт.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УровеньНесоответствияФакт = Выборка.ПланНаГод;
		Элементы.КомандаУровеньНесоответствияФакт.Заголовок = "Установлен с " + Формат(Выборка.Период, "ДЛФ=Д");
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИсторииИзмененийНаСервере()
	
	УровеньНесоответствияПлан = 0;
	Элементы.КомандаУровеньНесоответствияПлан.Заголовок = "Значение не установлено";
	
	УровеньНесоответствияФакт = 0;
	Элементы.КомандаУровеньНесоответствияФакт.Заголовок = "Значение не установлено";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	План.ПланНаГод КАК ПланНаГод,
	|	Факт.ФактЗаКвартал КАК ФактЗаКвартал,
	|	План.ПланДействуетС КАК ПланДействуетС,
	|	Факт.ФактДействуетС КАК ФактДействуетС,
	|	Факт.ОценкаПоставщика КАК ОценкаПоставщика
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СБ_ИсторияИзмененийПлан.ПланНаГод КАК ПланНаГод,
	|		СБ_ИсторияИзмененийПлан.Период КАК ПланДействуетС
	|	ИЗ
	|		РегистрСведений.СБ_ИсторияИзмененийПлан КАК СБ_ИсторияИзмененийПлан
	|	ГДЕ
	|		СБ_ИсторияИзмененийПлан.Контрагент = &Контрагент
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		СБ_ИсторияИзмененийПлан.Период УБЫВ) КАК План
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			СБ_ИсторияИзмененийФакт.ФактЗаКвартал КАК ФактЗаКвартал,
	|			СБ_ИсторияИзмененийФакт.ОценкаПоставщика КАК ОценкаПоставщика,
	|			СБ_ИсторияИзмененийФакт.Период КАК ФактДействуетС
	|		ИЗ
	|			РегистрСведений.СБ_ИсторияИзмененийФакт КАК СБ_ИсторияИзмененийФакт
	|		ГДЕ
	|			СБ_ИсторияИзмененийФакт.Контрагент = &Контрагент
	|		
	|		УПОРЯДОЧИТЬ ПО
	|			СБ_ИсторияИзмененийФакт.Период УБЫВ) КАК Факт
	|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(Выборка.ПланНаГод) Тогда УровеньНесоответствияПлан = Выборка.ПланНаГод; КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПланДействуетС) Тогда Элементы.КомандаУровеньНесоответствияПлан.Заголовок = "Установлен с " + Формат(Выборка.ПланДействуетС, "ДЛФ=Д"); КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ФактЗаКвартал) Тогда УровеньНесоответствияФакт = Выборка.ФактЗаКвартал; КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФактДействуетС) Тогда Элементы.КомандаУровеньНесоответствияФакт.Заголовок = "Установлен с " + Формат(Выборка.ФактДействуетС, "ДЛФ=Д"); КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТоварныеКатегорииПоПоставщикуНаСервере()
	
	СтрокаРезультат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СБ_ПоставщикиПоТоварнымКатегориям.ТоварнаяКатегория.Наименование КАК ТоварнаяКатегорияНаименование
	|ИЗ
	|	РегистрСведений.СБ_ПоставщикиПоТоварнымКатегориям КАК СБ_ПоставщикиПоТоварнымКатегориям
	|ГДЕ
	|	СБ_ПоставщикиПоТоварнымКатегориям.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаРезультат = СтрокаРезультат + Выборка.ТоварнаяКатегорияНаименование + "; "	
	
	КонецЦикла;
	
	ТоварныеКатегорииПоПоставщику = СтрокаРезультат;
	
КонецПроцедуры

