
&Вместо("ЗаполнитьПоПравилуЗаполнения")
Процедура СБ_ЗаполнитьПоПравилуЗаполнения()
	Параметры = Новый Структура("Ссылка, Сценарий, КроссТаблица, ИзменитьРезультатНа, ЗаполненоАвтоматически, ТочностьОкругления, 
		|Подразделение, Статус, Периодичность, НачалоПериода, ОкончаниеПериода");
	
	ЗаполнитьЗначенияСвойств(Параметры, ЭтотОбъект);
	
	//Добавлено СБ
	Если ПравилоЗаполнения.Количество() = 0 Тогда
		
		АдресПравилаЗаполнения = Планирование.ПолучитьАдресПравилаЗаполненияПоУмолчанию(Перечисления.ТипыПланов.ПланПроизводства, ЭтотОбъект.ВидПлана, Новый УникальныйИдентификатор);
		ЭтотОбъект.ПравилоЗаполнения.Загрузить(ПолучитьИзВременногоХранилища(АдресПравилаЗаполнения));
		ЭтотОбъект.ЗаполненоАвтоматически = Ложь;
		АдресПользовательскихНастроек = Планирование.ПолучитьАдресПользовательскихНастроекПоУмолчанию(Перечисления.ТипыПланов.ПланПроизводства, ЭтотОбъект.ВидПлана, Новый УникальныйИдентификатор);
		ЭтотОбъект.ПользовательскиеНастройки = АдресПользовательскихНастроек;
		 
	КонецЕсли;
	//Конец добавлено СБ
	
	Параметры.Вставить("ЗаполнятьПоПравилу", Истина);
	Параметры.Вставить("ПравилоЗаполнения", ПравилоЗаполнения.Выгрузить());
	Параметры.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки.Получить());
	
	//Добавлено СБ
	Если Не Параметры.Свойство("ВидПлана") Или Не ЗначениеЗаполнено(Параметры.ВидПлана) Тогда
		Параметры.Вставить("ВидПлана", ЭтотОбъект.ВидПлана)
	КонецЕсли;
	Если Не Параметры.Свойство("ТипПроизводственногоПроцесса") Или Не ЗначениеЗаполнено(Параметры.ТипПроизводственногоПроцесса) Тогда
		Параметры.Вставить("ТипПроизводственногоПроцесса", ЭтотОбъект.ТипПроизводственногоПроцесса);
	КонецЕсли;	
	Если Не Параметры.Свойство("КлючОбщихНастроек") Или Не ЗначениеЗаполнено(Параметры.КлючОбщихНастроек) Тогда
		Параметры.Вставить("КлючОбщихНастроек", "Документ.ПланПроизводства");
	КонецЕсли;
	Если Не Параметры.Свойство("ЗаполнятьСпецификациюПоПериодам") Или Не ЗначениеЗаполнено(Параметры.ЗаполнятьСпецификациюПоПериодам) Тогда
		Параметры.Вставить("ЗаполнятьСпецификациюПоПериодам", Ложь);
	КонецЕсли;
	//Конец добавлено СБ
	
	ЗаполняемаяТЧ = Продукция.Выгрузить();
	Если ОбновитьДополнить = 0 Тогда
		ЗаполняемаяТЧ.Очистить();
	КонецЕсли;
	
	Параметры.Вставить("ЗаполняемаяТЧ", ЗаполняемаяТЧ);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	Документы.ПланПроизводства.ЗаполнитьПоПравилуЗаполнения(Параметры, АдресХранилища);
	
	ЗаполняемаяТЧ = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Продукция.Загрузить(ЗаполняемаяТЧ);
	
	ЗаполненоАвтоматически = Истина;
КонецПроцедуры


Процедура СБ_ЗаполнитьРеквизитыПланаПоСценариюВидуПлана(ЭтоКопирование) Экспорт
	ЗаполнитьРеквизитыПланаПоСценариюВидуПлана(ЭтоКопирование);
КонецПроцедуры
