
&ИзменениеИКонтроль("ЗаполнитьРеквизитыЭтапаПриИзмененииСтатуса")
Функция Серии_ЗаполнитьРеквизитыЭтапаПриИзмененииСтатуса(Объект, СтатусДоИзменения, ДанныеЗаполнения)
	
	СтатусНачат       = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
	СтатусЗавершен    = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
	
	ИзмененныеРеквизиты = "";
	
	ДатаСобытия = Неопределено;
	Если ДанныеЗаполнения <> Неопределено Тогда
		ДанныеЗаполнения.Свойство("ДатаСобытия", ДатаСобытия);
	КонецЕсли;
	
	Если Объект.Статус <> СтатусДоИзменения Тогда
		
		ИзмененныеРеквизиты = "Статус";
		
		НачатоВыполнение =    (Объект.Статус = СтатусНачат ИЛИ Объект.Статус = СтатусЗавершен);
		ЗавершеноВыполнение = (Объект.Статус = СтатусЗавершен);
		
		ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",ФактическоеНачалоЭтапа,
		|ФактическоеОкончаниеЭтапа,
		|НачатоВыполнениеЭтапа,
		|ЗавершеноВыполнениеЭтапа,
		|Выполнено";
		
		УправлениеПроизводством.УстановитьДатуПоОтметке(
		НачатоВыполнение, 
		Объект.ФактическоеНачалоЭтапа,
		ДатаСобытия);
		
		УправлениеПроизводством.УстановитьДатуПоОтметке(
		ЗавершеноВыполнение, 
		Объект.ФактическоеОкончаниеЭтапа,
		ДатаСобытия,
		ЗавершеноВыполнение);
		
		#Вставка 	
		Попытка
			Если Объект.Статус = СтатусЗавершен ИЛИ Объект.Статус = СтатусНачат Тогда 
				Сч = 0;
				Для Каждого стрр из Объект.ОбеспечениеМатериаламиИРаботами цикл  
					Если Истина Тогда	 
						Если ПроверкаУчетаСерийМатериалов(стрр)и не ЗначениеЗаполнено(стрр.Серия) Тогда
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
							|	ТоварыНаСкладахОстатки.Серия КАК Серия
							|ПОМЕСТИТЬ ВТ
							|ИЗ
							|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
							|ГДЕ
							|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
							|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика
							|	И ТоварыНаСкладахОстатки.Назначение = &Назначение
							|	И ТоварыНаСкладахОстатки.Склад = &Склад
							|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	МИНИМУМ(ТоварыНаСкладах.Период) КАК Период,
							|	СУММА(ЕСТЬNULL(ВТ.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
							|	ВТ.Серия КАК Серия,
							|	СУММА(ЕСТЬNULL(ТоварыНаСкладах.ВНаличии, 0)) КАК ВНаличииПришло
							|ИЗ
							|	ВТ КАК ВТ
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
							|		ПО ВТ.Серия = ТоварыНаСкладах.Серия
							|ГДЕ
							|	ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
							|	И ТоварыНаСкладах.Номенклатура = &Номенклатура
							|	И ТоварыНаСкладах.Характеристика = &Характеристика
							|	И ТоварыНаСкладах.Назначение = &Назначение
							|	И ТоварыНаСкладах.Склад = &Склад
							|	И ТоварыНаСкладах.ВНаличии > 0
							|
							|СГРУППИРОВАТЬ ПО
							|	ВТ.Серия
							|
							|УПОРЯДОЧИТЬ ПО
							|	Период";
							
							Запрос.УстановитьПараметр("Назначение", ?(стрр.Обособленно,стрр.Назначение,Справочники.Назначения.ПустаяСсылка()));
							Запрос.УстановитьПараметр("Номенклатура", стрр.Номенклатура);
							Запрос.УстановитьПараметр("Склад", стрр.Склад);
							Запрос.УстановитьПараметр("Характеристика", стрр.Характеристика);
							
							РезультатЗапроса = Запрос.Выполнить().Выбрать();
							КоличествоОбщее = стрр.Количество;
							КОличествоСтарт = стрр.Количество; 

							Пока РезультатЗапроса.Следующий() и  КоличествоОбщее <>0 Цикл  
								Если КоличествоОбщее<>КОличествоСтарт Тогда  
									КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
									МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);  
									СтрОб = Объект.ОбеспечениеМатериаламиИРаботами.Вставить(Сч);
									//Добавить();
									ЗаполнитьЗначенияСвойств(СтрОб,стрр,,"ИдентификаторСтроки,КлючНоменклатура");
									СтрОб.Серия = РезультатЗапроса. Серия ;
									СтрОб.КоличествоУпаковок=МинКол;  
									СтрОб.Количество=МинКол;
									СтрОб.СтатусУказанияСерий = 4;  
									СтрОб.СтатусУказанияСерийОтправитель = 4;

									КоличествоОбщее = КоличествоОбщее - МинКол; 
								Иначе 
									КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
									МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);
									стрр.Серия = РезультатЗапроса. Серия ;
									стрр.КоличествоУпаковок=МинКол; 
									стрр.Количество=МинКол;
									стрр.СтатусУказанияСерий = 4;  
									стрр.СтатусУказанияСерийОтправитель = 4;

									КоличествоОбщее = КоличествоОбщее - МинКол; 
								КонецЕсли;
							КонецЦикла;	
						КонецЕсли;
					КонецЕсли;
					Сч = Сч+1;
					КонецЦикла;	
				КонецЕсли;
				
		Исключение
					
		КонецПопытки;
				
		#КонецВставки
				
		ЗаполнитьВыполнениеЭтапаПоСтатусу(Объект, ДанныеЗаполнения, ИзмененныеРеквизиты);
		
	КонецЕсли;
			
	Возврат ИзмененныеРеквизиты;
			
КонецФункции
		
Функция ПроверкаУчетаСерийМатериалов(Строка) 
	
	ВидНоменклатуры    = ?(ЗначениеЗаполнено(Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий),Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий,Строка.Номенклатура.ВидНоменклатуры);  
	Если ВидНоменклатуры.ИспользоватьСерии И ВидНоменклатуры.ПолитикаУчетаСерий.УказыватьПриРасходеМатериалов Тогда 
		Отбор = Новый Структура("Склад",Строка.Склад);
		ПроверкаСклада = ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		Если ПроверкаСклада.Количество()>0 Тогда
			ПолитикаУчетаСерий = ПроверкаСклада[0].ПолитикаУчетаСерий;
		Иначе
			ПолитикаУчетаСерий = ВидНоменклатуры.ПолитикаУчетаСерий; 
		КонецЕсли;
		
		Если ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.СерииНеИспользуются Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;		
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции
