
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()	
	Запись.Контрагент = Запись.Договор.Партнер;	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда   
		
		Если Параметры.ЗначенияЗаполнения.Свойство("КатегорияМатериала") Тогда
			Запись.ТоварнаяКатегория = Параметры.ЗначенияЗаполнения.КатегорияМатериала;
		КонецЕсли; 
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ГруппаНоменклатуры") Тогда
			Запись.ГруппаНоменклатуры = Параметры.ЗначенияЗаполнения.ГруппаНоменклатуры;
		КонецЕсли;   
		
		Если Параметры.ЗначенияЗаполнения.Свойство("Договор") Тогда
			Запись.Договор = Параметры.ЗначенияЗаполнения.Договор;
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Запись.СтепеньЗначимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Контрагент, "СБ_СтепеньЗначимостиПоставщика");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры
