
Функция СоздатьСерию(Номенклатура,Распоряжение) 
	
	ВладелецСерий     = ?(ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры.ВладелецСерий),Номенклатура.ВидНоменклатуры.ВладелецСерий,Номенклатура.ВидНоменклатуры); 
	МаксимальныйНомерИзСправочника = Справочники.СерииНоменклатуры.ВычислитьМаксимальныйНомерСерии(ВладелецСерий);
	
	Номер = МаксимальныйНомерИзСправочника+1;
			 
	Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Серия.ВидНоменклатуры 	= Номенклатура.ВидНоменклатуры;	
	Серия.Номер             = Номер;
	Серия.ДатаПроизводства 	= ТекущаяДата();
	Серия.ГоденДо 			= ДобавитьМесяц(ТекущаяДата(),12*?(ЗначениеЗаполнено(Номенклатура.СрокГодности), Номенклатура.СрокГодности, 1));
	Серия.Наименование      = Номер+ " от "+Серия.ДатаПроизводства+" до "+Серия.ГоденДо;
	Серия.Записать();
				 
	Возврат Серия.Ссылка;
		
КонецФункции
	 
Функция ПроверитьВедениеУчетаПоСериям(Номенклатура) 
	
	ВидНоменклатуры     = ?(ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры.ВладелецСерий),Номенклатура.ВидНоменклатуры.ВладелецСерий,Номенклатура.ВидНоменклатуры);  
	Возврат ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции
	 
Функция ВернутьСтатус() 
		 Возврат Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
КонецФункции

&НаКлиенте 
Процедура SB1_СтатусПриИзмененииПосле(Элемент)
	
	Попытка
		 Для каждого стр из Объект.ВыходныеИзделия Цикл   
			 Если стр.Произведено или Объект.Статус = ВернутьСтатус() Тогда
				 Если	ПроверитьВедениеУчетаПоСериям(стр.Номенклатура) Тогда  
					 НайдСтроки = Объект.ВыходныеИзделияСерии.НайтиСтроки(Новый Структура("Номенклатура", стр.Номенклатура)); 
					 Если НайдСтроки.Количество() = 0 Тогда 
						 Серия = СоздатьСерию(Стр.Номенклатура,Объект.Распоряжение); 
						 Если ЗначениеЗаполнено(Серия) Тогда
							 СтрСерия = Объект.ВыходныеИзделияСерии.Добавить();
							 ЗаполнитьЗначенияСвойств(СтрСерия,Стр); 
							 СтрСерия.Серия =  	Серия;
							 стр.СтатусУказанияСерий = 4;  
							 стр.СтатусУказанияСерийОтправитель = 2;
							 стр.СтатусУказанияСерийПолучатель = 4;
							 
						 КонецЕсли;
					 КонецЕсли;
				 КонецЕсли;  
			 КонецЕсли;
		 КонецЦикла; 
	 Исключение
	 КонецПопытки;
	 
КонецПроцедуры

&НаКлиенте
Процедура SB1_ВыходныеИзделияПроизведеноПриИзмененииПосле(Элемент)
	
	ТекущиеДанные = Элементы.ВыходныеИзделия.ТекущиеДанные;  
	Попытка
		Если Объект.Статус = ВернутьСтатус() или ТекущиеДанные.Произведено Тогда
			Если  ПроверитьВедениеУчетаПоСериям(ТекущиеДанные.Номенклатура) Тогда 
				 
				НайдСтроки = Объект.ВыходныеИзделияСерии.НайтиСтроки(Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура)); 
				Если НайдСтроки.Количество() = 0 Тогда 
					СтрСерия = Объект.ВыходныеИзделияСерии.Добавить();
					ЗаполнитьЗначенияСвойств(СтрСерия,ТекущиеДанные);
					СтрСерия.Серия =  СоздатьСерию(ТекущиеДанные.Номенклатура,Объект.Распоряжение);
					ТекущиеДанные.СтатусУказанияСерий = 4;  
					ТекущиеДанные.СтатусУказанияСерийОтправитель = 2;
					ТекущиеДанные.СтатусУказанияСерийПолучатель = 4;
					 
				КонецЕсли;  
			КонецЕсли;
		КонецЕсли;  
	Исключение
	КонецПопытки;

КонецПроцедуры

Функция ПроверкаУчетаСерийМатериалов(Строка) 
	
	ВидНоменклатуры    = ?(ЗначениеЗаполнено(Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий),Строка.Номенклатура.ВидНоменклатуры.ВладелецСерий,Строка.Номенклатура.ВидНоменклатуры);  
	Если ВидНоменклатуры.ИспользоватьСерии И ВидНоменклатуры.ПолитикаУчетаСерий.УказыватьПриРасходеМатериалов Тогда 
		Отбор = Новый Структура("Склад",Строка.Склад);
		ПроверкаСклада = ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		Если ПроверкаСклада.Количество()>0 Тогда
			ПолитикаУчетаСерий = ПроверкаСклада[0].ПолитикаУчетаСерий;
		Иначе
			ПолитикаУчетаСерий = ВидНоменклатуры.ПолитикаУчетаСерий; 
		КонецЕсли;
		
		Если ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.СерииНеИспользуются Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;		
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции 

&НаСервере
&ИзменениеИКонтроль("ПослеЗаполненияОбеспечения")
Процедура СБ_ПослеЗаполненияОбеспечения(Изменения, Режим = Неопределено, ПараметрыЗаполнения = Неопределено)
	
	ИзмененныеРеквизиты = Документы.ЭтапПроизводства2_2.ПослеЗаполненияОбеспечения(
		Объект,
		Изменения,
		Режим,
		ПараметрыЗаполнения,
		ДанныеЗаполненияПриИзмененииСтатуса());
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "НеОтгружатьЧастями");
		
	СтруктураДействий = Новый Структура();
	ОбеспечениеВДокументахКлиентСервер.ДобавитьДействияОбеспечения(
		СтруктураДействий,
		"СкладОбязателен,ДатаОтгрузкиОбязательна",
		ПараметрыДокументаДляДействийОбеспечения(ЭтотОбъект));
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	КоллекцияНаФорме = ОбеспечениеВДокументахКлиентСервер.КоллекцияНаФорме(
		ЭтотОбъект, ДоступныеОстаткиПараметрыВстраивания);
	
	ОбрабатываемыеСтроки = Новый Массив();
	
	Для Каждого Изменение Из Изменения Цикл
		ОбрабатываемыеСтроки.Добавить(Изменение.Строка);
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		КоллекцияНаФорме,
		КэшированныеЗначения);
	
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(
		Объект.ОбеспечениеМатериаламиИРаботами,
		ДатаОтгрузкиОбязательна,
		СкладОбязателен);
	#Вставка
	ЗаполнитьСерииОбеспечениеМатериаламиИРаботами();
	#КонецВставки

	Если ТекущийСтатус <> Объект.Статус Тогда
		ПослеИзмененияСтатусаНаСервере(ИзмененныеРеквизиты);
	КонецЕсли;
	ОбновитьКолонкуДоступноСервер();
	
КонецПроцедуры

Процедура ЗаполнитьСерииОбеспечениеМатериаламиИРаботами()   
	
	Попытка
		Сч = 0;
		Для каждого стрр из Объект.ОбеспечениеМатериаламиИРаботами цикл 
			Если ПроверкаУчетаСерийМатериалов(стрр) и стрр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить и НЕ ЗначениеЗаполнено(стрр.Серия) Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
					|	ТоварыНаСкладахОстатки.Серия КАК Серия
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
					|ГДЕ
					|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
					|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика
					|	И ТоварыНаСкладахОстатки.Назначение = &Назначение
					|	И ТоварыНаСкладахОстатки.Склад = &Склад
					|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	МИНИМУМ(ТоварыНаСкладах.Период) КАК Период,
					|	СУММА(ЕСТЬNULL(ВТ.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
					|	ВТ.Серия КАК Серия,
					|	СУММА(ЕСТЬNULL(ТоварыНаСкладах.ВНаличии, 0)) КАК ВНаличииПришло
					|ИЗ
					|	ВТ КАК ВТ
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
					|		ПО ВТ.Серия = ТоварыНаСкладах.Серия
					|ГДЕ
					|	ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|	И ТоварыНаСкладах.Номенклатура = &Номенклатура
					|	И ТоварыНаСкладах.Характеристика = &Характеристика
					|	И ТоварыНаСкладах.Назначение = &Назначение
					|	И ТоварыНаСкладах.Склад = &Склад
					|	И ТоварыНаСкладах.ВНаличии > 0
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ.Серия
					|
					|УПОРЯДОЧИТЬ ПО
					|	Период";
					 
					Запрос.УстановитьПараметр("Назначение", ?(стрр.Обособленно,стрр.Назначение,Справочники.Назначения.ПустаяСсылка()));
					Запрос.УстановитьПараметр("Номенклатура", стрр.Номенклатура);
					Запрос.УстановитьПараметр("Склад", стрр.Склад);
					Запрос.УстановитьПараметр("Характеристика", стрр.Характеристика);
					 
					РезультатЗапроса = Запрос.Выполнить().Выбрать();
					КоличествоОбщее = стрр.Количество; 
					КоличествоСтарт = стрр.Количество; 
					 
					Пока РезультатЗапроса.Следующий() и  КоличествоОбщее <>0 Цикл  
						Если КоличествоОбщее<>КоличествоСтарт Тогда  
							КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
							МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);  
							СтрОб = Объект.ОбеспечениеМатериаламиИРаботами.Вставить(Сч);
							//Добавить();
							ЗаполнитьЗначенияСвойств(СтрОб,стрр,,"ИдентификаторСтроки,КлючНоменклатура");
							СтрОб.Серия = РезультатЗапроса. Серия ;
							СтрОб.КоличествоУпаковок=МинКол;  
							СтрОб.Количество=МинКол;
							 
							КоличествоОбщее = КоличествоОбщее - МинКол; 
						Иначе 
							КолМинОстПришло = Мин(РезультатЗапроса.ВНаличииОстаток,РезультатЗапроса.ВНаличииПришло);
							МинКол =  Мин(КолМинОстПришло, КоличествоОбщее);
							стрр.Серия = РезультатЗапроса. Серия ;
							стрр.КоличествоУпаковок=МинКол; 
							стрр.Количество=МинКол;
							 
							КоличествоОбщее = КоличествоОбщее - МинКол; 
						КонецЕсли;
				КонецЦикла;
			КонецЕсли;   
			
			Сч = Сч+1;
		КонецЦикла;	
		
	Исключение
		
	КонецПопытки;  
	
КонецПроцедуры
		 
 
#Область ОбработчикиФормы

&НаСервере
Процедура СБ_ПриОткрытииПослеНаСервере() 
	
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(Объект.ОтгружаемыеТовары, Объект.СБ_ДрагоценныеМеталлы, Объект.Склад); 
	
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "Родитель", "Родитель");
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");

	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Элементы.СтраницаДрагМеталлыВыход.Видимость = СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Объект.Склад);
	Иначе
		Элементы.СтраницаДрагМеталлыВыход.Видимость = Ложь;
		Объект.СБ_ДрагоценныеМеталлы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПриОткрытииПосле(Отказ)
	СБ_ПриОткрытииПослеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДрагоценныеМеталлы

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПосле(Элемент)
	СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере()
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();              
	
	ПересчитатьВесаДерева(ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
	
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПосле(Элемент) 
	
	СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СБ_СБ_ДрагоценныеМеталлыПЕредУдалениемПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыПослеУдаленияПосле(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры                                     

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыРасходПослеУдаленияПосле(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлы();	
КонецПроцедуры

#КонецОбласти    

#Область ОбработчикиТовары

&НаКлиенте
Процедура СБ_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСтатусУказанияСерийПриИзмененииПосле(Элемент) 
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();               
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)       
	
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, , ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();
	
КонецПроцедуры

#КонецОбласти 

#Область Прочее

&НаСервереБезКонтекста
Процедура ПересчитатьВесаДерева(Дерево) Экспорт
	ПересчитатьСуммыСтрок(Дерево.Строки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьСуммыСтрок(Строки)        
	
	Для каждого Строка Из Строки Цикл
		
		Если Строка.Строки.Количество() > 0 Тогда
			//ПересчитатьУзел(Строка.Строки);   
			
			СуммаЧистый = 0;
			СуммаЛигатурный = 0;
			Для каждого Дочерняя Из Строка.Строки Цикл
				СуммаЧистый = СуммаЧистый + Дочерняя.ЧистыйВес;
				//СуммаЛигатурный = СуммаЛигатурный + Дочерняя.ЛигатурныйВес;
			КонецЦикла;
			
			Строка.ЧистыйВес = СуммаЧистый;
			//Строка.ЛигатурныйВес = СуммаЛигатурный;
		КонецЕсли;  
		
	КонецЦикла;       
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличество(Номенклатура, Характеристика, Серия, КоличествоУпаковок, Склад, ЕдиницаИзмерения) Экспорт  
	
	СтруктураТовар =Новый Структура();
	СтруктураТовар.Вставить("Номенклатура", Номенклатура);
	СтруктураТовар.Вставить("Характеристика", Характеристика);
	СтруктураТовар.Вставить("Серия", Серия);
	СтруктураТовар.Вставить("КоличествоУпаковок", КоличествоУпаковок);
	СтруктураТовар.Вставить("Склад", Склад);
	СтруктураТовар.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	Дерево = ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, РеквизитФормыВЗначение("ДеревоДрагМеталлы"));
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДрагМеталлы"); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, Дерево)        
	
	СтрокаНайдена = Ложь;
	Для каждого Строка Из Дерево.Строки Цикл
		
		Если СтруктураТовар.Номенклатура = Строка.Номенклатура И СтруктураТовар.Серия = Строка.Серия И СтруктураТовар.Характеристика = Строка.Характеристика Тогда
			СтрокаНайдена = Истина;	
			Дерево.Строки.Удалить(Строка);
			ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);
			Возврат Дерево;
		КонецЕсли;  
		
	КонецЦикла;
	
	Если Не СтрокаНайдена Тогда
		Возврат ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);	
	КонецЕсли;     
	
	Возврат Дерево;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСтрокуВДерево(СтруктураЗаполнения, Дерево)        
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДрагоценныеМатериалы.Ссылка КАК НоменклатураРодитель,
	|	НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Количество КАК КоличествоДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураДрагоценныеМатериалы.СБ_ПроцентСодержания КАК СБ_ПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.СБ_ИспользоватьПроцентСодержания КАК СБ_ИспользоватьПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.ВесЧислитель КАК Вес
	|ИЗ
	|	Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|ГДЕ
	|	НоменклатураДрагоценныеМатериалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураЗаполнения.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НоваяСтрокаРодитель = Дерево.Строки.Добавить();
	
	НоваяСтрокаРодитель.Номенклатура = СтруктураЗаполнения.Номенклатура;
	//НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
	НоваяСтрокаРодитель.Характеристика = СтруктураЗаполнения.Характеристика;
	НоваяСтрокаРодитель.Количество = СтруктураЗаполнения.КоличествоУпаковок; 
	//НоваяСтрока.Количество = Выборка.КоличествоУпаковок;
	НоваяСтрокаРодитель.ЕдиницаИзмерения = СтруктураЗаполнения.ЕдиницаИзмерения;
	НоваяСтрокаРодитель.Склад = СтруктураЗаполнения.Склад;
	НоваяСтрокаРодитель.Серия = СтруктураЗаполнения.Серия;
	//НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
	НоваяСтрокаРодитель.ЧистыйВес = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
		
		НоваяСтрока = НоваяСтрокаРодитель.Строки.Добавить();
		
		НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
		НоваяСтрока.Характеристика = НоваяСтрокаРодитель.Характеристика;
		//НоваяСтрока.Количество = НоваяСтрокаРодитель.Количество; 
		//НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		//НоваяСтрока.Склад = НоваяСтрокаРодитель.Склад;
		//НоваяСтрока.Серия = НоваяСтрокаРодитель.Серия;
		//НоваяСтрока.ЛигатурныйВес = Выборка.Вес;
		
		Если Выборка.СБ_ИспользоватьПроцентСодержания Тогда
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.Вес * (Выборка.СБ_ПроцентСодержания / 100);	
		Иначе
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.КоличествоДрагоценныйМатериал;
		КонецЕсли;
		
		НоваяСтрокаРодитель.ЧистыйВес = НоваяСтрокаРодитель.ЧистыйВес + НоваяСтрока.ЧистыйВес;
		
		
		
		
		
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции 

&НаСервере
Процедура ПересчитатьТаблицуДрагоценныеМеталлы()        
	
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);

КонецПроцедуры

&НаСервере
Процедура СБ_ПересчитатьДрагМеталлыПослеНаСервере()      
	
	ОбъектТовары = РеквизитФормыВЗначение("Объект.ВыходныеИзделия");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТовары, Объект.СБ_ДрагоценныеМеталлы,, Истина);
	ЗаполнитьСерииПоВнешнейТаблице(Объект.СБ_ДрагоценныеМеталлы, Объект.ВыходныеИзделияСерии);
	
	ОбъектТоварыПобочные = РеквизитФормыВЗначение("Объект.ПобочныеИзделия");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТоварыПобочные, Объект.СБ_ДрагоценныеМеталлы,, Истина, Истина);
	ЗаполнитьСерииПоВнешнейТаблице(Объект.СБ_ДрагоценныеМеталлы, Объект.ПобочныеИзделияСерии);
	//Элементы.ДеревоДрагМеталлы.Очистить();
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");                                            
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", "Родитель");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");                        
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПересчитатьДрагМеталлыРасходПосле(Команда)
	СБ_ПересчитатьДрагМеталлыРасходПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииПоВнешнейТаблице(ТаблицаИсходная, ТаблицаДонор)
	Для Каждого СтрокаТЧ Из ТаблицаИсходная Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			ПараметрыОтбора = Новый Структура;
    		ПараметрыОтбора.Вставить("Номенклатура", СтрокаТЧ.Номенклатура); 
			ПараметрыОтбора.Вставить("Характеристика", СтрокаТЧ.Характеристика);
			ПараметрыОтбора.Вставить("Количество", СтрокаТЧ.Количество);
    		НайденныеСтроки = ТаблицаДонор.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаТЧ.Серия = НайденныеСтроки[0].Серия;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура СБ_ПересчитатьДрагМеталлыРасходПослеНаСервере()      
	
	ОбъектТовары = РеквизитФормыВЗначение("Объект.РасходМатериаловИРабот");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТовары, Объект.СБ_ДрагоценныеМеталлыРасход,, Истина);
	
	//Элементы.ДеревоДрагМеталлы.Очистить();
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");                                            
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", "Родитель");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлыРасход.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлыРасход");                        
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПересчитатьДрагМеталлыПосле(Команда)
	СБ_ПересчитатьДрагМеталлыПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СБ_ТоварыСерияПриИзмененииПосле(Элемент)
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОкончаниеВводаТекстаПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция СБ_ПоискСерии(АдресВоВременномХранилище)
	
	Результат = Новый Структура;
	Результат.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Результат.Вставить("КоличествоУпаковок", 0);
	
	ТаблицаСерийИКоличества = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ТаблицаСерийИКоличества.Количество() > 0 Тогда
		
		СтрокаИзВременногоХранилища = ТаблицаСерийИКоличества.Получить(0);
		
		Результат["Серия"] = СтрокаИзВременногоХранилища.Серия;
		Результат["КоличествоУпаковок"] = СтрокаИзВременногоХранилища.КоличествоУпаковок;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьСтрокиНаСуществование(ТаблицаТовары, ДеревоДрагМеталлы) 
	
	Для Каждого СтрокаДерева Из ДеревоДрагМеталлы.Строки Цикл
		СтрокаНайдена = Ложь;
		Для Каждого СтрокаТЧ Из ТаблицаТовары Цикл
			
			Если СтрокаТЧ.Номенклатура = СтрокаДерева.Номенклатура
				И СтрокаТЧ.Характеристика = СтрокаДерева.Характеристика
				И СтрокаТЧ.Серия = СтрокаДерева.Серия Тогда
				СтрокаНайдена = Истина;	
			КонецЕсли;
						
		КонецЦикла;	
		
		Если Не СтрокаНайдена Тогда
			ДеревоДрагМеталлы.Строки.Удалить(СтрокаДерева);		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьСтрокиВДеревеНаСуществованиеНаСервере() 
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы"); 
	ПроверитьСтрокиНаСуществование(Объект.ОтгружаемыеТовары, ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
КонецПроцедуры

//&НаКлиенте
//&ИзменениеИКонтроль("ТоварыПриАктивизацииСтрокиНаКлиенте")
//Процедура СБ_ТоварыПриАктивизацииСтрокиНаКлиенте()

//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

//	Если ТекущаяСтрока <> Неопределено Тогда

//		ВывестиДополнительнуюИнформациюПоНоменклатуре(
//		ТекущаяСтрока.Номенклатура,
//		ТекущаяСтрока.Характеристика,
//		ТекущаяСтрока.Упаковка);

//		Элементы.СписокУпаковок.ТекущаяСтрока = ТекущаяСтрока.Упаковка;

//	Иначе

//		ВывестиДополнительнуюИнформациюПоНоменклатуре();

//	КонецЕсли;
//	
//			
//	//#Вставка     
//	//ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
//	//#КонецВставки

//КонецПроцедуры
  
&НаКлиенте
Процедура СБ_СкладПриИзмененииПосле(Элемент)	
	Элементы.ГруппаДрагоценныеМеталлы.Видимость = НЕ СкладИспользуетОрдернуюСхему(Объект.Склад); 

	Если НЕ Элементы.ГруппаДрагоценныеМеталлы.Видимость Тогда
		Объект.СБ_ДрагоценныеМеталлы.Очистить();
	Иначе
		СБ_ПересчитатьДрагМеталлыПослеНаСервере();
	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Функция СкладИспользуетОрдернуюСхему(СкладСсылка)	
	Возврат СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(СкладСсылка);	
КонецФункции

&НаСервере
Процедура СБ_ОтгружаемыеТоварыВесПриИзмененииПослеНаСервере(Номенклатура, Характеристика, Серия, КоличествоУпаковок, ЛигатурныйВес)
	
	Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы"); 
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.Номенклатура = Номенклатура И СтрокаДерева.Характеристика = Характеристика И СтрокаДерева.Серия = Серия Тогда 
			
			СтрокаДерева.ЛигатурныйВес = ЛигатурныйВес;
			СтрокаДерева.Количество = КоличествоУпаковок;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДрагМеталлы");
	
	ПересчитатьТаблицуДрагоценныеМеталлы();
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ОтгружаемыеТоварыВесПриИзмененииПосле(Элемент)
		
	ЭлементФормыДанные = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	
	СБ_ОтгружаемыеТоварыВесПриИзмененииПослеНаСервере(ЭлементФормыДанные.Номенклатура, ЭлементФормыДанные.Характеристика, ЭлементФормыДанные.Серия, ЭлементФормыДанные.КоличествоУпаковок, ЭлементФормыДанные.Вес);
КонецПроцедуры

#КонецОбласти

