
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда 
		ПроведениеДрагМеталлов();	                                                  
	Иначе 
		СБ_ДрагоценныеМеталлы.Очистить();
	КонецЕсли;
	#КонецВставки
	
	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ВнутреннееПотреблениеЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	//++ НЕ УТ
	Если Не Отказ Тогда
		УчетПодакцизныхТоваров.СоздатьЗаданиеНаЗаписьСуммыАкциза(ЭтотОбъект);
		ПрочиеАктивыПассивыСервер.СоздатьЗаданиеДляНеоперативногоПроведенияДокумента(ЭтотОбъект);
	КонецЕсли;
	//-- НЕ УТ

КонецПроцедуры 

Процедура ПроведениеДрагМеталлов()
	СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход);	
КонецПроцедуры
