
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка   
	
	Движения.СБ_ДвиженияДрагоценныхМеталлов.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из СБ_ДрагоценныеМеталлы Цикл
		Движение = Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Регистратор = ЭтотОбъект;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.ЛигатурныйВес = ТекСтрокаТовары.ЛигатурныйВес;
		Движение.ЧистыйВес = ТекСтрокаТовары.ЧистыйВес;
		Движение.ЕдиницаИзмеренияВеса = ТекСтрокаТовары.ЕдиницаИзмерения;
	КонецЦикла;
	Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		
	#КонецВставки
	
	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыРегистрации = Документы.ПриобретениеТоваровУслуг.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриПроведении(ПараметрыРегистрации);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
	
	ПриобретениеТоваровУслугЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры
