&После("ЗаполнитьРеквизитыПриУстановкеСтатуса")
Процедура СБ_ЗаполнитьРеквизитыПриУстановкеСтатуса(Объект) Экспорт
	
	ЗаполнитьСерииВыходныхИзделий(Объект);
	
КонецПроцедуры

Процедура ЗаполнитьСерииВыходныхИзделий(Объект)
	
	ТаблицаИзделий 	= Объект.ВыходныеИзделия;
	ТаблицаСерий 	= Объект.ВыходныеИзделияСерии;
	Для Каждого СтрокаИ Из ТаблицаИзделий Цикл
		Если СтрокаИ.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
			НовСтрокаСерий = ТаблицаСерий.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаСерий,СтрокаИ);
			НовСтрокаСерий.Серия =  СоздатьСерию(СтрокаИ.Номенклатура, Объект);
			СтрокаИ.СтатусУказанияСерий = 2;  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры      

Функция СоздатьСерию(Номенклатура, Объект) 
	
	//Добавить дату производства и годен до
	
	Номер = "00000001";
	
	ВидНоменклатуры     = ?(ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры.ВладелецСерий),Номенклатура.ВидНоменклатуры.ВладелецСерий,Номенклатура.ВидНоменклатуры);  
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);
	НаборСвойствСерий = ВидНоменклатуры.НаборСвойствСерий.ДополнительныеРеквизиты;
	
	МаксимальныйНомер = Справочники.СерииНоменклатуры.ВычислитьМаксимальныйНомерСерии(ВидНоменклатуры);	
	
	Если МаксимальныйНомер<>0 Тогда 
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 		= ВидНоменклатуры;	
		Серия.Номер               	= Формат(Число(СокрЛП(МаксимальныйНомер))+1, "ЧЦ=8; ЧВН=; ЧГ="); 
		Серия.ДатаПроизводства		= НачалоДня(?(Объект.ОкончаниеВыполнения = Дата(1,1,1),ТекущаяДата(),Объект.ОкончаниеВыполнения));
		Серия.ГоденДо				= НоменклатураКлиентСервер.ГоденДоПоДатеПроизводства(Серия.ДатаПроизводства, ?(Номенклатура.СрокГодности=0,1,Номенклатура.СрокГодности), Номенклатура.ЕдиницаИзмеренияСрокаГодности);
		Серия.Наименование        	= НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, Серия);
		Серия.RFIDМеткаНеЧитаемая 	= Ложь;
		//допреквизиты (партия детали, партия материала, штамп/пф)
		ТаблицаДР = Серия.ДополнительныеРеквизиты;
		Для Каждого СтрокаДР Из НаборСвойствСерий Цикл
			//Партия материалов
			Если СтрокаДР.Свойство.ИдентификаторДляФормул = "ПартияМатериала" Тогда
				НоваяСтрокаДр = ТаблицаДР.Добавить();
				НоваяСтрокаДр.Свойство = СтрокаДР.Свойство;
				НоваяСтрокаДр.Значение = НайтиСериюОсновногоМатериала(Объект.МатериалыИРаботы);
			//Штамп и П/ф
			ИначеЕсли СтрокаДР.Свойство.ИдентификаторДляФормул = "Штамп" ИЛИ СтрокаДР.Свойство.ИдентификаторДляФормул = "ПрессФорма" Тогда
				Оснастка = НайтиОснастку(Объект.Этап);
				Если ЗначениеЗаполнено(Оснастка) Тогда
					НоваяСтрокаДр = ТаблицаДР.Добавить();
					НоваяСтрокаДр.Свойство = СтрокаДР.Свойство;
					НоваяСтрокаДр.Значение = НайтиЗначениеДопРеквизита(СтрокаДР.Свойство, Оснастка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Серия.Записать();       	 
	Иначе  
		Серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Серия.ВидНоменклатуры 		= ВидНоменклатуры;	
		Серия.Номер               	= Номер; 
		Серия.ДатаПроизводства		= НачалоДня(?(Объект.ОкончаниеВыполнения = Дата(1,1,1),ТекущаяДата(),Объект.ОкончаниеВыполнения));
		Серия.ГоденДо				= НоменклатураКлиентСервер.ГоденДоПоДатеПроизводства(Серия.ДатаПроизводства, ?(Номенклатура.СрокГодности=0,1,Номенклатура.СрокГодности), Номенклатура.ЕдиницаИзмеренияСрокаГодности);
		Серия.Наименование        	= НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, Серия);
		Серия.RFIDМеткаНеЧитаемая 	= Ложь;
		//допреквизиты (партия детали, партия материала, штамп/пф)

		Серия.Записать();			             	
	КонецЕсли;	
	
	Возврат Серия.Ссылка;
	
КонецФункции      

Функция НайтиСериюОсновногоМатериала(Материалы);
	
	Партия = "";
	
	Отбор = Новый Структура();
	Отбор.Вставить("СтатьяКалькуляции",Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Основной материал"));
	Строки = Материалы.НайтиСтроки(Отбор);
	Если Строки.Количество()>0 Тогда
		Партия = Строки[0].Серия.Наименование;			
	КонецЕсли;
	
	Возврат Партия;
	
КонецФункции 

Функция НайтиЗначениеДопРеквизита(Свойство, Наименование) 
	
	ЗначениеДР = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Наименование,Истина,,Свойство);
	
	Если ЗначениеЗаполнено(ЗначениеДР) Тогда
		Возврат ЗначениеДР; 
	Иначе		
		НовоеЗначениеДР = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();   
		НовоеЗначениеДР.Владелец 		= Свойство;
		НовоеЗначениеДР.Наименование 	= Наименование;
		Попытка
			НовоеЗначениеДР.Записать();
			Возврат НовоеЗначениеДР.Ссылка;
		Исключение
			Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
		КонецПопытки;	
	КонецЕсли;
	
КонецФункции

Функция НайтиОснастку(Этап)
	
	Оснастка = "Нет";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Наименование КАК ВидРабочегоЦентраНаименование
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
		|ГДЕ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = &Ссылка
		|	И ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Родитель = &РодительШтамп
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Наименование
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
		|ГДЕ
		|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = &Ссылка
		|	И ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра.Родитель = &РодительПФ";
	
	Запрос.УстановитьПараметр("РодительПФ", Справочники.ВидыРабочихЦентров.НайтиПоНаименованию("Пресс-формы"));
	Запрос.УстановитьПараметр("РодительШтамп", Справочники.ВидыРабочихЦентров.НайтиПоНаименованию("Штампы"));
	Запрос.УстановитьПараметр("Ссылка", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВидРабочегоЦентраНаименование;
	КонецЦикла;
	
	Возврат Оснастка;

	
КонецФункции
