&Вместо("ЗаполнитьМатериалыПоНормативам")
Процедура СБ_ЗаполнитьМатериалыПоНормативам(Материалы) 
	
	Для каждого Строка Из Материалы Цикл
		Если Строка.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия КАК Серия,
				|	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество
				|ИЗ
				|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
				|ГДЕ
				|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = &Номенклатура
				|	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия
				|
				|УПОРЯДОЧИТЬ ПО
				|	Количество
				|АВТОУПОРЯДОЧИВАНИЕ";
				
			Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
			Запрос.УстановитьПараметр("Ссылка", Этап);
				
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
				
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = МатериалыИРаботы.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
				НоваяСтрока.Серия 		= ВыборкаДетальныеЗаписи.Серия;
				НоваяСтрока.Количество 	= ВыборкаДетальныеЗаписи.Количество;
				НоваяСтрока.КоличествоУпаковок = ВыборкаДетальныеЗаписи.Количество;
			КонецЦикла;
	    Иначе
			НоваяСтрока = МатериалыИРаботы.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);	
		КонецЕсли;		
	КонецЦикла;
	
	МатериалыЭтапа = Документы.ЭтапПроизводства2_2.ОстаткиОбеспечиваемыхМатериалов(Этап, "Характеристика");
	МатериалыЭтапа.Индексы.Добавить("Номенклатура, Характеристика");
	
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика");
	КэшированныеЗначения = Неопределено;
	
	Для Индекс = 0 По МатериалыИРаботы.Количество()-1 Цикл
		
		Строка = МатериалыИРаботы[Индекс];
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		НайденныеСтроки = МатериалыЭтапа.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ОтметитьСтрокаМатериалаОтсутствуетВЭтапе(Строка);
			
		Иначе
			
			СтрокаМатериалЭтапа = НайденныеСтроки[0];
			
			Если СтрокаМатериалЭтапа.Количество = Строка.Количество Тогда
				
				МатериалыЭтапа.Удалить(СтрокаМатериалЭтапа);
				
			ИначеЕсли СтрокаМатериалЭтапа.Количество > Строка.Количество Тогда
				
				СтрокаМатериалЭтапа.Количество = СтрокаМатериалЭтапа.Количество - Строка.Количество;
				
			Иначе
				
				КоличествоНедостача = Строка.Количество - СтрокаМатериалЭтапа.Количество;
				
				Строка.Количество = СтрокаМатериалЭтапа.Количество;
				ПересчитатьКоличествоУпаковок(Строка, КэшированныеЗначения);
				
				НоваяСтрока = МатериалыИРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Количество = КоличествоНедостача;
				ПересчитатьКоличествоУпаковок(НоваяСтрока, КэшированныеЗначения);
				ОтметитьСтрокаМатериалаОтсутствуетВЭтапе(НоваяСтрока);
				
				МатериалыЭтапа.Удалить(СтрокаМатериалЭтапа);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура СБ_ПроведениеДрагМеталлы()
	
	Объект = ЭтотОбъект;
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлыРасход Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);

				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		//Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		                                                            
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлы Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);

				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		
		                                                            
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
	
КонецПроцедуры