
&НаСервере
&ИзменениеИКонтроль("ТипПолитикиПриИзмененииНаСервере")
Процедура СБ_ТипПолитикиПриИзмененииНаСервере()

	Если Не ЗначениеЗаполнено(Объект.ТипПолитики) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий Тогда
		Объект.УчетСерийПоFEFO                = Ложь;
		Объект.УчитыватьОстаткиСерий          = Ложь;
		Объект.УчитыватьСебестоимостьПоСериям = Ложь;

		Если Объект.УказыватьПриОтгрузке Тогда
			НастройкаУказанияСерийПриОтгрузке = "ПоФактуОтбора";
		Иначе
			НастройкаУказанияСерийПриОтгрузке = "";
		КонецЕсли;

		Объект.УказыватьПриПересчетеТоваров  = Ложь;
		Объект.УказыватьПриОтраженииНедостач = Ложь;

		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;

		//++ НЕ УТ
		Объект.УчетСерийВПереданныхНаХранениеТоварах   = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров = Ложь;
		//-- НЕ УТ
		Объект.УчетСерийВПереданныхНаКомиссиюТоваров = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту    = Ложь;

	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий Тогда
		Объект.УчетСерийПоFEFO                     = Ложь;
		Объект.УчитыватьОстаткиСерий               = Ложь;
		Объект.УчитыватьСебестоимостьПоСериям = Ложь;

		Объект.УказыватьПриОтгрузке                       = Ложь;
		Объект.УказыватьПриОтгрузкеКлиенту                = Ложь;
		Объект.УказыватьПриОтгрузкеВРозницу               = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Ложь;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Ложь;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Ложь;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Ложь;

		НастройкаУказанияСерийПриОтгрузке = "";

		Объект.УказыватьПриПриемке                              = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента           = Истина;
		Объект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика                  = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению                 = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов           = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки    = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию        = Истина;
		Объект.УказыватьПриПриемкеПродукцииИзПроизводства       = Истина;

		Объект.УказыватьПриОтраженииИзлишков = Истина;
		Объект.УказыватьПриОтраженииНедостач = Ложь;
		Объект.УказыватьПриПересчетеТоваров  = Ложь;

		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;

		//++ НЕ УТ
		Объект.УказыватьПриДвиженииМатериалов                      = Истина;
		Объект.УказыватьПриДвиженииПродукции                       = Истина;
		Объект.УказыватьПриПолученииМатериалов                     = Истина;
		Объект.УказыватьПриВозвратеНаСклад                         = Ложь;
		Если ИспользуетсяПроизводство21 Тогда
			Объект.УказыватьПриРасходеМатериалов			       = Ложь;
		КонецЕсли;
		Объект.УказыватьПриОтраженииЗатратНаПроизводство           = Ложь;
		Объект.УказыватьПриВыпускеВПодразделение                   = Истина;
		Объект.УчетСерийВПереданныхНаХранениеТоварах               = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров             = Ложь;
		//-- НЕ УТ

		Объект.УчетСерийВПереданныхНаКомиссиюТоваров       = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту          = Ложь;
		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;

	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий Тогда
		Объект.УчетСерийПоFEFO                     = Ложь;
		Объект.УчитыватьСебестоимостьПоСериям = Ложь;
		Объект.УчитыватьОстаткиСерий               = Истина;

		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;

		Объект.УказыватьПриПриемке                              = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента           = Истина;
		Объект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика                  = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению                 = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов           = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки    = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию        = Истина;
		Объект.УказыватьПриПриемкеПродукцииИзПроизводства       = Истина;

		Объект.УказыватьПриОтраженииИзлишков = Истина;
		Объект.УказыватьПриОтраженииНедостач = Истина;
		Объект.УказыватьПриПересчетеТоваров  = Истина;

		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;

		//++ НЕ УТ
		Объект.УказыватьПриДвиженииМатериалов                      = Истина;
		Объект.УказыватьПриДвиженииПродукции                       = Истина;
		Объект.УказыватьПриПолученииМатериалов                     = Истина;
		Объект.УказыватьПриВозвратеНаСклад                         = Истина;
		Если ИспользуетсяПроизводство21 Тогда
			Объект.УказыватьПриРасходеМатериалов				   = Истина;
		КонецЕсли;
		Объект.УказыватьПриОтраженииЗатратНаПроизводство           = Истина;
		Объект.УказыватьПриВыпускеВПодразделение                   = Истина;
		Объект.УчетСерийВПереданныхНаХранениеТоварах               = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров             = Ложь;
		//-- НЕ УТ

		Объект.УчетСерийВПереданныхНаКомиссиюТоваров       = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту          = Ложь;
		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;

	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий Тогда
		Объект.УчетСерийПоFEFO                     = Истина;
		Объект.УчитыватьСебестоимостьПоСериям = Ложь;
		Объект.УчитыватьОстаткиСерий               = Истина;
		НастройкаУказанияСерийПриОтгрузке          = "ПриПланированииОтбора";

		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;

		Объект.УказыватьПриПриемке                              = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента           = Истина;
		Объект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика                  = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению                 = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию        = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов           = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки    = Истина;
		Объект.УказыватьПриПриемкеПродукцииИзПроизводства       = Истина;

		Объект.УказыватьПриОтраженииИзлишков              = Истина;
		Объект.УказыватьПриОтраженииНедостач              = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Истина;

		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;

		//++ НЕ УТ
		Объект.УказыватьПриДвиженииМатериалов                      = Истина;
		Объект.УказыватьПриДвиженииПродукции                       = Истина;
		Объект.УказыватьПриПолученииМатериалов                     = Истина;
		Объект.УказыватьПриВозвратеНаСклад                         = Истина;
		Если ИспользуетсяПроизводство21 Тогда
			Объект.УказыватьПриРасходеМатериалов				   = Истина;
		КонецЕсли;
		Объект.УказыватьПриОтраженииЗатратНаПроизводство           = Истина;
		Объект.УказыватьПриВыпускеВПодразделение                   = Истина;
		Объект.УчетСерийВПереданныхНаХранениеТоварах               = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров             = Ложь;
		//-- НЕ УТ

		Объект.УчетСерийВПереданныхНаКомиссиюТоваров       = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту          = Ложь;
		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;
    #Вставка 
	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СБ_УправлениеПоFIFOОстаткамиСерий Тогда
		Объект.УчетСерийПоFEFO                     	= Ложь;
		Объект.УчитыватьСебестоимостьПоСериям 		= Истина;
		Объект.УчитыватьОстаткиСерий               	= Истина;
		НастройкаУказанияСерийПриОтгрузке          	= "ПриПланированииОтбора";
		
		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;
		
		Объект.УказыватьПриПриемке                              = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента           = Истина;
		Объект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика                  = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению                 = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию        = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов           = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки    = Истина;
		Объект.УказыватьПриПриемкеПродукцииИзПроизводства       = Истина;
		
		Объект.УказыватьПриОтраженииИзлишков              = Истина;
		Объект.УказыватьПриОтраженииНедостач              = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Истина;
		
		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;
		
		//++ НЕ УТ
		Объект.УказыватьПриДвиженииМатериалов                      = Истина;
		Объект.УказыватьПриДвиженииПродукции                       = Истина;
		Объект.УказыватьПриПолученииМатериалов                     = Истина;
		Объект.УказыватьПриВозвратеНаСклад                         = Истина;
		Если ИспользуетсяПроизводство21 Тогда
			Объект.УказыватьПриРасходеМатериалов				   = Истина;
		КонецЕсли;
		Объект.УказыватьПриОтраженииЗатратНаПроизводство           = Истина;
		Объект.УказыватьПриВыпускеВПодразделение                   = Истина;
		Объект.УчетСерийВПереданныхНаХранениеТоварах               = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров             = Ложь;
		//-- НЕ УТ
		
		Объект.УчетСерийВПереданныхНаКомиссиюТоваров       = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту          = Ложь;
		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;   	
	#КонецВставки
	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям Тогда
		Объект.УчетСерийПоFEFO                     = Ложь;
		Объект.УчитыватьСебестоимостьПоСериям = Истина;
		Объект.УчитыватьОстаткиСерий               = Истина;
		НастройкаУказанияСерийПриОтгрузке          = "ПриПланированииОтгрузки";

		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;

		Объект.УказыватьПриПриемке                              = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента           = Истина;
		Объект.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика                  = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению                 = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию        = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов           = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки    = Истина;
		Объект.УказыватьПриПриемкеПродукцииИзПроизводства       = Истина;

		Объект.УказыватьПриОтраженииИзлишков              = Истина;
		Объект.УказыватьПриОтраженииНедостач              = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Истина;

		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;

		//++ НЕ УТ
		Объект.УказыватьПриДвиженииМатериалов                      = Истина;
		Объект.УказыватьПриДвиженииПродукции                       = Истина;
		Объект.УказыватьПриПолученииМатериалов                     = Истина;
		Объект.УказыватьПриВозвратеНаСклад                         = Истина;
		Объект.УказыватьПриРасходеМатериалов					   = Истина;
		Если ИспользуетсяПроизводство22 Тогда
			Объект.УказыватьПриПроизводствеПродукции               = Истина;
		КонецЕсли;
		Объект.УказыватьПриОтраженииЗатратНаПроизводство           = Истина;
		Объект.УказыватьПриВыпускеВПодразделение                   = Истина;
		Объект.УчетСерийВПереданныхНаХранениеТоварах               = Ложь;
		Объект.УчетСерийПереданныхПереработчикуТоваров             = Ложь;
		//-- НЕ УТ

		Объект.УчетСерийВПереданныхНаКомиссиюТоваров       = Ложь;
		Объект.УчетСерийТоваровОтгруженныхКлиенту          = Ложь;
		Объект.УчетСерийВНеотфактурованныхПоставкахТоваров = Ложь;
		Объект.УчетТоваровВПутиОтПоставщикаПоСериям        = Ложь;

	КонецЕсли;

	ТипПолитикиПриИзмененииНаСервереЛокализация();

	НастроитьЭлементыФормыНаСервере();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьЭлементыФормыНаСервере")
Процедура СБ_НастроитьЭлементыФормыНаСервере()

	ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");

	//++ НЕ УТ
	ИспользуетсяПроизводство22Без21 = ИспользуетсяПроизводство22 И Не ИспользуетсяПроизводство21;

	Если Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий Тогда
		Элементы.ГруппаВЭксплуатации.Заголовок = НСтр("ru = 'В эксплуатации (управление остатками серий)';
		|en = 'In operation (batch balance management)'");
	Иначе
		Элементы.ГруппаВЭксплуатации.Заголовок = НСтр("ru = 'В эксплуатации';
		|en = 'In operation'");
	КонецЕсли;
	//-- НЕ УТ

	Если Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий Тогда

		Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность           = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриВозвратеНепринятыхПолучателемТоваров.Доступность = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеОтПоставщика.Доступность                  = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеПоПеремещению.Доступность                 = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность           = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность    = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность        = Объект.УказыватьПриПриемке;
		Элементы.УказыватьПриПриемкеПродукцииИзПроизводства.Доступность       = Объект.УказыватьПриПриемке;

		Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Объект.УказыватьПриОтгрузке;
		Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Объект.УказыватьПриОтгрузке;

		Элементы.УказыватьПриОтраженииИзлишков.Доступность              = ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач;
		Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Истина;
		Элементы.УказыватьПриПриемке.Доступность                        = Истина;
		Элементы.УказыватьПриОтгрузке.Доступность                       = Истина;
		Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;

		//++ НЕ УТ
		Элементы.УказыватьПриДвиженииМатериалов.Доступность             = Истина;
		Элементы.УказыватьПриПолученииМатериалов.Доступность            = Объект.УказыватьПриДвиженииМатериалов;
		Элементы.УказыватьПриВозвратеНаСклад.Доступность                = Объект.УказыватьПриДвиженииМатериалов;
		Элементы.УказыватьПриРасходеМатериалов.Доступность              = Объект.УказыватьПриДвиженииМатериалов Или ИспользуетсяПроизводство22Без21;
		Элементы.УказыватьПриОтраженииЗатратНаПроизводство.Доступность  = Объект.УказыватьПриДвиженииМатериалов;

		Элементы.УказыватьПриДвиженииПродукции.Доступность              = Истина;
		Элементы.УказыватьПриПроизводствеПродукции.Доступность          = Объект.УказыватьПриДвиженииПродукции Или ИспользуетсяПроизводство22Без21;
		Элементы.УказыватьПриВыпускеВПодразделение.Доступность          = Объект.УказыватьПриДвиженииПродукции;

		Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве';
		|en = 'In production'");

		Элементы.УчетСерийПереданныхПереработчикуТоваров.Доступность = Ложь;
		//-- НЕ УТ

		Элементы.УчетСерийВПереданныхНаХранениеТоварах.Доступность       = Ложь;
		Элементы.УчетСерийВПереданныхНаКомиссиюТоваров.Доступность       = Ложь;
		Элементы.УчетСерийТоваровОтгруженныхКлиенту.Доступность          = Ложь;
		Элементы.УчетСерийВНеотфактурованныхПоставкахТоваров.Доступность = Ложь;
		Элементы.УчетТоваровВПутиОтПоставщикаПоСериям.Доступность        = Ложь;

	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий Тогда

		Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность           = Ложь;
		Элементы.УказыватьПриВозвратеНепринятыхПолучателемТоваров.Доступность = Ложь;
		Элементы.УказыватьПриПриемкеОтПоставщика.Доступность                  = Ложь;
		Элементы.УказыватьПриПриемкеПоПеремещению.Доступность                 = Ложь;
		Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность           = Ложь;
		Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность    = Ложь;
		Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность        = Ложь;
		Элементы.УказыватьПриПриемкеПродукцииИзПроизводства.Доступность       = Ложь;

		Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;

		Элементы.УказыватьПриОтраженииИзлишков.Доступность              = Ложь;
		Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;
		Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;

		//++ НЕ УТ
		Элементы.УказыватьПриДвиженииМатериалов.Доступность             = Ложь;
		Элементы.УказыватьПриПолученииМатериалов.Доступность            = Ложь;
		Элементы.УказыватьПриВозвратеНаСклад.Доступность                = Ложь;
		Элементы.УказыватьПриРасходеМатериалов.Доступность              = ИспользуетсяПроизводство22Без21;
		Элементы.УказыватьПриОтраженииЗатратНаПроизводство.Доступность  = Ложь;

		Элементы.УказыватьПриДвиженииПродукции.Доступность              = Ложь;
		Элементы.УказыватьПриПроизводствеПродукции.Доступность          = Истина;
		Элементы.УказыватьПриВыпускеВПодразделение.Доступность          = Ложь;

		Если ИспользуетсяПроизводство22Без21 Тогда
			Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве (справочное указание)';
			|en = 'In production (reference specification)'");
		Иначе
			Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве';
			|en = 'In production'");
		КонецЕсли;

		Элементы.УчетСерийПереданныхПереработчикуТоваров.Доступность = Ложь;
		//-- НЕ УТ

		Элементы.УчетСерийВПереданныхНаХранениеТоварах.Доступность       = Ложь;
		Элементы.УчетСерийВПереданныхНаКомиссиюТоваров.Доступность       = Ложь;
		Элементы.УчетСерийТоваровОтгруженныхКлиенту.Доступность          = Ложь;
		Элементы.УчетСерийВНеотфактурованныхПоставкахТоваров.Доступность = Ложь;
		Элементы.УчетТоваровВПутиОтПоставщикаПоСериям.Доступность        = Ложь;

	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий
		Или Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий Тогда

		Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность           = Ложь;
		Элементы.УказыватьПриВозвратеНепринятыхПолучателемТоваров.Доступность = Ложь;
		Элементы.УказыватьПриПриемкеОтПоставщика.Доступность                  = Ложь;
		Элементы.УказыватьПриПриемкеПоПеремещению.Доступность                 = Ложь;
		Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность           = Ложь;
		Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность    = Ложь;
		Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность        = Ложь;
		Элементы.УказыватьПриПриемкеПродукцииИзПроизводства.Доступность       = Ложь;

		Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;

		Элементы.УказыватьПриОтраженииИзлишков.Доступность              = Ложь;
		Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;

		Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность =
		(Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий);

		//++ НЕ УТ
		Элементы.УказыватьПриДвиженииМатериалов.Доступность             = Ложь;
		Элементы.УказыватьПриПолученииМатериалов.Доступность            = Ложь;
		Элементы.УказыватьПриВозвратеНаСклад.Доступность                = Ложь;
		Элементы.УказыватьПриРасходеМатериалов.Доступность              = ИспользуетсяПроизводство22Без21;
		Элементы.УказыватьПриОтраженииЗатратНаПроизводство.Доступность  = Ложь;

		Элементы.УказыватьПриДвиженииПродукции.Доступность              = Ложь;
		Элементы.УказыватьПриПроизводствеПродукции.Доступность          = Истина;
		Элементы.УказыватьПриВыпускеВПодразделение.Доступность          = Ложь;

		Если ИспользуетсяПроизводство22Без21 Тогда
			Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве (справочное указание)';
			|en = 'In production (reference specification)'");
		Иначе
			Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве';
			|en = 'In production'");
		КонецЕсли;

		Элементы.УчетСерийПереданныхПереработчикуТоваров.Доступность = Ложь;
		//-- НЕ УТ

		Элементы.УчетСерийВПереданныхНаХранениеТоварах.Доступность       = Ложь;
		Элементы.УчетСерийВПереданныхНаКомиссиюТоваров.Доступность       = Ложь;
		Элементы.УчетСерийТоваровОтгруженныхКлиенту.Доступность          = Ложь;
		Элементы.УчетСерийВНеотфактурованныхПоставкахТоваров.Доступность = Ложь;
		Элементы.УчетТоваровВПутиОтПоставщикаПоСериям.Доступность        = Ложь;
    #Вставка
	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СБ_УправлениеПоFIFOОстаткамиСерий Тогда

		Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность           = Ложь;
		Элементы.УказыватьПриВозвратеНепринятыхПолучателемТоваров.Доступность = Ложь;
		Элементы.УказыватьПриПриемкеОтПоставщика.Доступность                  = Ложь;
		Элементы.УказыватьПриПриемкеПоПеремещению.Доступность                 = Ложь;
		Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность           = Ложь;
		Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность    = Ложь;
		Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность        = Ложь;
		Элементы.УказыватьПриПриемкеПродукцииИзПроизводства.Доступность       = Ложь;

		Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;

		Элементы.УказыватьПриОтраженииИзлишков.Доступность              = Ложь;
		Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;

		Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;

		//++ НЕ УТ
		Элементы.УказыватьПриДвиженииМатериалов.Доступность             = Ложь;
		Элементы.УказыватьПриПолученииМатериалов.Доступность            = Ложь;
		Элементы.УказыватьПриВозвратеНаСклад.Доступность                = Ложь;
		Элементы.УказыватьПриРасходеМатериалов.Доступность              = Ложь;
		Элементы.УказыватьПриОтраженииЗатратНаПроизводство.Доступность  = Ложь;

		Элементы.УказыватьПриДвиженииПродукции.Доступность              = Ложь;
		Элементы.УказыватьПриПроизводствеПродукции.Доступность          = НЕ ИспользуетсяПроизводство22;
		Элементы.УказыватьПриВыпускеВПодразделение.Доступность          = Ложь;

		Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве';
		|en = 'In production'");

		Элементы.УчетСерийПереданныхПереработчикуТоваров.Доступность = Истина;
		//-- НЕ УТ

		Элементы.УчетСерийВПереданныхНаХранениеТоварах.Доступность       = Истина;
		Элементы.УчетСерийВПереданныхНаКомиссиюТоваров.Доступность       = Истина;
		Элементы.УчетСерийТоваровОтгруженныхКлиенту.Доступность          = Истина;
		Элементы.УчетСерийВНеотфактурованныхПоставкахТоваров.Доступность = Истина;
		Элементы.УчетТоваровВПутиОтПоставщикаПоСериям.Доступность        = Истина;

	#КонецВставки
	ИначеЕсли Объект.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям Тогда

		Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность           = Ложь;
		Элементы.УказыватьПриВозвратеНепринятыхПолучателемТоваров.Доступность = Ложь;
		Элементы.УказыватьПриПриемкеОтПоставщика.Доступность                  = Ложь;
		Элементы.УказыватьПриПриемкеПоПеремещению.Доступность                 = Ложь;
		Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность           = Ложь;
		Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность    = Ложь;
		Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность        = Ложь;
		Элементы.УказыватьПриПриемкеПродукцииИзПроизводства.Доступность       = Ложь;

		Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;

		Элементы.УказыватьПриОтраженииИзлишков.Доступность              = Ложь;
		Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;

		Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;

		//++ НЕ УТ
		Элементы.УказыватьПриДвиженииМатериалов.Доступность             = Ложь;
		Элементы.УказыватьПриПолученииМатериалов.Доступность            = Ложь;
		Элементы.УказыватьПриВозвратеНаСклад.Доступность                = Ложь;
		Элементы.УказыватьПриРасходеМатериалов.Доступность              = Ложь;
		Элементы.УказыватьПриОтраженииЗатратНаПроизводство.Доступность  = Ложь;

		Элементы.УказыватьПриДвиженииПродукции.Доступность              = Ложь;
		Элементы.УказыватьПриПроизводствеПродукции.Доступность          = НЕ ИспользуетсяПроизводство22;
		Элементы.УказыватьПриВыпускеВПодразделение.Доступность          = Ложь;

		Элементы.ГруппаУчитыватьСерииВПроизводстве.Заголовок = НСтр("ru = 'В производстве';
		|en = 'In production'");

		Элементы.УчетСерийПереданныхПереработчикуТоваров.Доступность = Истина;
		//-- НЕ УТ

		Элементы.УчетСерийВПереданныхНаХранениеТоварах.Доступность       = Истина;
		Элементы.УчетСерийВПереданныхНаКомиссиюТоваров.Доступность       = Истина;
		Элементы.УчетСерийТоваровОтгруженныхКлиенту.Доступность          = Истина;
		Элементы.УчетСерийВНеотфактурованныхПоставкахТоваров.Доступность = Истина;
		Элементы.УчетТоваровВПутиОтПоставщикаПоСериям.Доступность        = Истина;

	КонецЕсли;

	НастроитьЭлементыФормыНаСервереЛокализация(ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач);

КонецПроцедуры
