
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	Отказ = НЕ КонтрольОстатковПоЯчейкамПройден();
	#КонецВставки
	
	
	ПроверитьБлокировкуЯчеек(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	СкладыСервер.ОтразитьСостоянияПересчетовЯчеек(ЭтотОбъект.Ссылка, ЭтотОбъект.Статус, Отказ);
	
	
КонецПроцедуры 

Функция КонтрольОстатковПоЯчейкамПройден()
	
	Результат = Истина;
	
	ТаблицаДляКонтроля = ЭтотОбъект.ТоварыРазмещение.Выгрузить();
	ТаблицаДляКонтроля.Свернуть("Номенклатура, Серия, Ячейка, Упаковка", "КоличествоУпаковок");
	Для Каждого ТекущаяСтрока Из ТаблицаДляКонтроля Цикл
		
		Результат = СБ_РасчетСкладскихЯчеек.СБ_ПроверкаВозможностиЗаполненияЯчейки(ТекущаяСтрока.Ячейка, ТекущаяСтрока.Упаковка.Типоразмер, ТекущаяСтрока.КоличествоУпаковок);
		
		Если НЕ Результат Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
