&НаКлиенте  
&Вместо("СгенерироватьНомер")
Процедура SB_СгенерироватьНомер(Команда)
	
	Результат = ВычислитьМаксимальныйНомерИКоличество(1);
	ТекущаяСтрока = Результат.ТекущаяСтрока;
	Номер = Результат.Номер;
	
	Номер = Номер+1;
	Если Объект.Серии.Количество() > 0
		И Не ЗначениеЗаполнено(Объект.Серии[0].Номер) Тогда
		ТекущиеДанные = Объект.Серии[0];
		Если ТекущиеДанные.КоличествоУпаковок = 0 Тогда
			
			ТекущиеДанные.КоличествоУпаковок = 1; 
			
			ПараметрыПересчетаКоличества = Новый Структура("Упаковка, Номенклатура", Упаковка, ЗначенияПолейСвязи.Номенклатура);
			СтруктураДействий = Новый Структура("ПересчитатьКоличествоЕдиниц", ПараметрыПересчетаКоличества);
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
			
		КонецЕсли;
	Иначе
		Элементы.Серии.ДобавитьСтроку();
		ТекущиеДанные = Элементы.Серии.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,ТекущаяСтрока);
		//Заполним дату производства и срок годности
		ТекущиеДанные.ДатаПроизводства 		= ТекущаяДата();
 		ТекущиеДанные.ГоденДо 				= ДобавитьМесяц(ТекущаяДата(),12*?(ЗначениеЗаполнено(СрокГодности(ТекущаяСтрока.Номенклатура)), ТекущаяСтрока.Номенклатура.СрокГодности, 1));	
		ТекущиеДанные.КоличествоВДокументе 	= ЭтаФорма.КоличествоВДокументе;
		ТекущиеДанные.КоличествоУпаковок 	= ЭтаФорма.Количество; 
		ТекущиеДанные.Количество		 	= ЭтаФорма.Количество;
		
		//
	КонецЕсли;
	
	ТекущиеДанные.Номер =  Формат(Номер, "ЧЦ=8; ЧВН=; ЧГ=");
	
	Элементы.Серии.ЗакончитьРедактированиеСтроки(Ложь);
	
	Если НастройкиИспользованияСерий.ИспользоватьСрокГодностиСерии Тогда
		Элементы.Серии.ТекущийЭлемент = Элементы.СерииГоденДо;
	ИначеЕсли НастройкиИспользованияСерий.ИспользоватьКоличествоСерии Тогда
		Элементы.Серии.ТекущийЭлемент = Элементы.СерииКоличествоУпаковок;
	КонецЕсли;
	
	СерииПриИзменении(Неопределено);
	
КонецПроцедуры 

&НаКлиенте 
&Вместо("СерииПриНачалеРедактирования")
Процедура SB_СерииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ТекущаяДатаПроизводства = ТекущиеДанные.ДатаПроизводства;
	
	Если Копирование Тогда
		ТекущееКоличество = 0;
	Иначе
		ТекущееКоличество =  ТекущиеДанные.КоличествоУпаковок;
	КонецЕсли;
	
	ТекущиеДанные.КоличествоВДокументе 	= ЭтаФорма.КоличествоВДокументе;
	ТекущиеДанные.КоличествоУпаковок 	= ЭтаФорма.Количество; 
	ТекущиеДанные.Количество		 	= ЭтаФорма.Количество;
	
	
КонецПроцедуры

&НаСервере
Функция СрокГодности(Номенклатура)

	СрокГодности = Номенклатура.СрокГодности;	
	
КонецФункции
		 
