Функция СформироватьДеревоДрагоценныеМеталлы(Объект, Дерево) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ НоменклатураВТ
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураВТ.Номенклатура КАК Номенклатура,
	|	НоменклатураВТ.Характеристика КАК Характеристика,
	|	НоменклатураВТ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НоменклатураВТ.Количество КАК Количество,
	|	НоменклатураВТ.Упаковка КАК Упаковка,
	|	НоменклатураВТ.Серия КАК Серия,
	|	НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Количество КАК КоличествоДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Расположение КАК РасположениеДрагоценныйМатериал
	|ИЗ
	|	НоменклатураВТ КАК НоменклатураВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|		ПО НоменклатураВТ.Номенклатура = НоменклатураДрагоценныеМатериалы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущаяНоменклатура = Неопределено;
	ТекущаяСтрокаРодитель = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТекущаяНоменклатура <> Выборка.Номенклатура Тогда  
			
			ТекущаяНоменклатура = Выборка.Номенклатура;
			ТекущаяСтрокаРодитель = Дерево.Строки.Добавить();
			
			ТекущаяСтрокаРодитель.Номенклатура = Выборка.Номенклатура;
			ТекущаяСтрокаРодитель.Характеристика = Выборка.Характеристика;
			ТекущаяСтрокаРодитель.КоличествоУпаковок = Выборка.КоличествоУпаковок; 
			ТекущаяСтрокаРодитель.Количество = Выборка.Количество;
			ТекущаяСтрокаРодитель.Упаковка = Выборка.Упаковка;
			ТекущаяСтрокаРодитель.Серия = Выборка.Серия;
			//ТекущаяСтрокаРодитель.КомментарийТовара = Выборка.КомментарийТовара;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДрагоценныйМатериал) Тогда
			ДочерняяСтрока = ТекущаяСтрокаРодитель.Строки.Добавить();
			ДочерняяСтрока.ДрагоценныйМатериал = Выборка.ДрагоценныйМатериал;
			ДочерняяСтрока.Количество = Выборка.КоличествоДрагоценныйМатериал; 
			ДочерняяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияДрагоценныйМатериал;
			ДочерняяСтрока.Расположение = Выборка.РасположениеДрагоценныйМатериал;
			//ДочерняяСтрока.КомментарийМатериала = Выборка.КомментарийМатериала;
		КонецЕсли;  
		
	КонецЦикла;   
	
	Возврат Дерево;
	
КонецФункции

Процедура СформироватьСтраницуДрагоценныеМеталлы(Форма, ГруппаСтраницыНаименование) Экспорт 
	
	ГруппаСтраницы = Форма.Элементы.Найти(ГруппаСтраницыНаименование);
	
	СтраницаДрагоценныеМеталлы = Форма.Элементы.Добавить("ДрагоценныеМеталлы", Тип("ГруппаФормы"), Форма.Элементы[ГруппаСтраницыНаименование]); 
	СтраницаДрагоценныеМеталлы.Заголовок = "Драгоценные металлы";
	СтраницаДрагоценныеМеталлы.Вид = ВидГруппыФормы.Страница;
	СтраницаДрагоценныеМеталлы.ОтображатьЗаголовок = Истина; 
	СтраницаДрагоценныеМеталлы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДеревоДрагМеталлы = Новый РеквизитФормы("ДеревоДрагМеталлы", Новый ОписаниеТипов("ДеревоЗначений"));
	ДобавляемыеРеквизиты.Добавить(ДеревоДрагМеталлы);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	НовыйЭлемент = Форма.Элементы.Добавить("ДрагМеталлы", Тип("ТаблицаФормы"), СтраницаДрагоценныеМеталлы);
	НовыйЭлемент.ПутьКДанным = "ДеревоДрагМеталлы";
	НовыйЭлемент.Отображение = ОтображениеТаблицы.Дерево;
	
КонецПроцедуры  

Процедура ПроведениеДрагоценныеМеталлы(Объект, ВидДвиженияНакопления, СкладПредопределенный = Неопределено) Экспорт 
	
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = ?(ЗначениеЗаполнено(СкладПредопределенный), СкладПредопределенный, Справочники.Склады.ПустаяСсылка());
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлы Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);
				
				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		
	Исключение      
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти таблицу ""Драгоценные металлы""");
	КонецПопытки;
	
КонецПроцедуры 

Процедура ЗаполнитьКолонкиДеревоДрагоценныеМеталлы(Дерево) Экспорт 
	
	Дерево.Колонки.Добавить("Номенклатура");
	Дерево.Колонки.Добавить("Характеристика");
	Дерево.Колонки.Добавить("КоличествоУпаковок");
	Дерево.Колонки.Добавить("Количество");
	Дерево.Колонки.Добавить("Упаковка");
	Дерево.Колонки.Добавить("Серия");
	Дерево.Колонки.Добавить("КомментарийТовара");
	Дерево.Колонки.Добавить("ДрагоценныйМатериал");
	Дерево.Колонки.Добавить("КоличествоМатериала");
	Дерево.Колонки.Добавить("ЕдиницаИзмерения");
	Дерево.Колонки.Добавить("Расположение");
	Дерево.Колонки.Добавить("КомментарийМатериала");
	
КонецПроцедуры  

Процедура ЗаполнитьДерево(Форма, Объект, Дерево) Экспорт 
	
	ЗаполнитьКолонкиДеревоДрагоценныеМеталлы(Дерево);
	
	СформироватьДеревоДрагоценныеМеталлы(Объект, Дерево);
	
КонецПроцедуры   

Функция ЗаполнитьПустуюТаблицуДрагМеталлы(ТаблицаТовары, ТаблицаДрагМеталлы, Склад = Неопределено, ИспользуетсяКакПересчет = Ложь, ИспользуетсяКакСклейкаТаблиц = Ложь) Экспорт 
	
	Если ТаблицаДрагМеталлы.Количество() > 0 И НЕ ИспользуетсяКакПересчет Тогда
		Возврат ТаблицаДрагМеталлы;	
	КонецЕсли;
	
	ТаблицаТоварыВыгрузка = ТаблицаТовары.Выгрузить();
	Если ТаблицаТоварыВыгрузка.Колонки.Найти("Количество") <> Неопределено И ТаблицаТоварыВыгрузка.Колонки.Найти("КоличествоУпаковок") = Неопределено Тогда
		ТаблицаТоварыВыгрузка.Колонки.Количество.Имя = "КоличествоУпаковок";
		ТаблицаТоварыВыгрузка.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	КонецЕсли;  
	
	Если ТаблицаТоварыВыгрузка.Колонки.Найти("Упаковка") = Неопределено Тогда
		ТаблицаТоварыВыгрузка.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,";
	
	Если ЗначениеЗаполнено(Склад) ИЛИ ТаблицаТоварыВыгрузка.Колонки.Найти("Склад") = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	&Склад КАК Склад,"; 
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Склад = Справочники.Склады.ПустаяСсылка(); 
		КонецЕсли;
	Иначе 
		Запрос.Текст = Запрос.Текст + "
		|	ТаблицаТовары.Склад КАК Склад,";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Упаковка КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ НоменклатураВТ
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал, ЗНАЧЕНИЕ(Справочник.ДрагоценныеМатериалы.ПустаяСсылка)) КАК ДрагоценныйМатериал,
	|	ЕСТЬNULL(НоменклатураДрагоценныеМатериалы.Количество, 0) КАК КоличествоДрагоценныйМатериал,
	|	ЕСТЬNULL(НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмеренияДрагоценныйМатериал,
	|	ЕСТЬNULL(НоменклатураДрагоценныеМатериалы.Расположение, ЗНАЧЕНИЕ(Перечисление.РасположениеДрагоценныхКамней.ПустаяСсылка)) КАК РасположениеДрагоценныйМатериал,
	|	ЕСТЬNULL(НоменклатураДрагоценныеМатериалы.СБ_ПроцентСодержания, 0) КАК СБ_ПроцентСодержания,
	|	НоменклатураВТ.Номенклатура КАК НоменклатураРодитель,
	|	НоменклатураВТ.Характеристика КАК Характеристика,
	|	НоменклатураВТ.Склад КАК Склад,
	|	НоменклатураВТ.Серия КАК Серия,
	|	НоменклатураВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураВТ.Количество КАК КоличествоНоменклатураРодитель,
	|	НоменклатураВТ.КоличествоУпаковок КАК КоличествоУпаковокНоменклатураРодитель,
	|	НоменклатураСправочник.ВесЧислитель КАК Вес,
	|	ЕСТЬNULL(НоменклатураСправочник.СБ_ИспользоватьПроцентСодержания, ЛОЖЬ) КАК СБ_ИспользоватьПроцентСодержания	
	|ИЗ
	|	НоменклатураВТ КАК НоменклатураВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|		ПО НоменклатураВТ.Номенклатура = НоменклатураДрагоценныеМатериалы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО НоменклатураВТ.Номенклатура = НоменклатураСправочник.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТоварыВыгрузка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СкладИспользуется", ЗначениеЗаполнено(Склад));
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат ТаблицаДрагМеталлы;
	КонецЕсли;
	
	Если НЕ ИспользуетсяКакСклейкаТаблиц Тогда
		ТаблицаДрагМеталлы.Очистить();            
	КонецЕсли;
	
	НоменклатураРодительИзменения = Неопределено;
	СерияРодительИзменения = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДрагоценныйМатериал) Тогда
			Продолжить;
		КонецЕсли;                                                           
		
		Если НЕ (НоменклатураРодительИзменения = Выборка.НоменклатураРодитель И СерияРодительИзменения = Выборка.Серия) Тогда 
			
			НоменклатураРодительИзменения = Выборка.НоменклатураРодитель; 
			СерияРодительИзменения = Выборка.Серия;  
			
			НоваяСтрокаРодитель = ТаблицаДрагМеталлы.Добавить();
			
			НоваяСтрокаРодитель.Номенклатура = Выборка.НоменклатураРодитель;
			//НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
			НоваяСтрокаРодитель.Характеристика = Выборка.Характеристика;
			НоваяСтрокаРодитель.Количество = Выборка.КоличествоУпаковокНоменклатураРодитель; 
			//НоваяСтрока.Количество = Выборка.КоличествоУпаковок;
			НоваяСтрокаРодитель.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрокаРодитель.Склад = Выборка.Склад;
			НоваяСтрокаРодитель.Серия = Выборка.Серия;
			НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес * НоваяСтрокаРодитель.Количество;
			НоваяСтрокаРодитель.ЧистыйВес = 0;   
			НоваяСтрокаРодитель.РодительНоменклатура = Новый УникальныйИдентификатор();
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДрагМеталлы.Добавить();
		
		НоваяСтрока.РодительНоменклатура = НоваяСтрокаРодитель.РодительНоменклатура;
		НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
		НоваяСтрока.Характеристика = Выборка.Характеристика;
		НоваяСтрока.Количество = Выборка.КоличествоУпаковокНоменклатураРодитель; 
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрокаРодитель.ЕдиницаИзмерения;
		НоваяСтрока.Склад = НоваяСтрокаРодитель.Склад;
		НоваяСтрока.Серия = НоваяСтрокаРодитель.Серия;
		НоваяСтрока.ЛигатурныйВес = НоваяСтрокаРодитель.ЛигатурныйВес;
		//НоваяСтрока.ЧистыйВес = Выборка.КоличествоДрагоценныйМатериал;
		//НоваяСтрока.РодительНоменклатура = НоваяСтрокаРодитель.РодительНоменклатура;
		
		Если Выборка.СБ_ИспользоватьПроцентСодержания Тогда
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * НоваяСтрока.ЛигатурныйВес * (Выборка.СБ_ПроцентСодержания / 100);
			//НоваяСтрока.ЧистыйВес = НоваяСтрока.ЛигатурныйВес * Выборка.СБ_ПроцентСодержания;
		Иначе
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.КоличествоДрагоценныйМатериал;
			//НоваяСтрока.ЧистыйВес = Выборка.КоличествоДрагоценныйМатериал;
		КонецЕсли;
		
		НоваяСтрокаРодитель.ЧистыйВес = НоваяСтрокаРодитель.ЧистыйВес + НоваяСтрока.ЧистыйВес;
		
	КонецЦикла;
	
	Возврат ТаблицаДрагМеталлы;
	
КонецФункции   

// Процедура выгружает данные из таблицы значений в дерево значений
// данные выгружаются только в таблицу со сходным набором реквизитов
//
// Параметры:
//
// КлючСтроки - имя колонки ТаблицыЗначений - уникальный идентификатор
// КлючСвязи - имя колонки ТаблицыЗначений - указатель привязки к строке Дерева,
// своего рода указатель на "Родителя"
//
Функция ВыгрузитьТаблицуЗначенийВДеревоЗначений(Таблица, КлючСтроки = "КлючСтроки", КлючСвязи = "КлючСвязи") Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаГруппировки = Дерево.Строки.Найти(СтрокаТаблицы[КлючСвязи], КлючСтроки,Истина);
		
		Если СтрокаГруппировки = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), СтрокаТаблицы);
		Иначе
			НоваяСтрока = СтрокаГруппировки.Строки.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТаблицы.Номенклатура; 
			НоваяСтрока.ЧистыйВес = СтрокаТаблицы.ЧистыйВес;
			//НоваяСтрока.Характеристика = СтрокаТаблицы.Характеристика; 
			//НоваяСтрока.Количество = СтрокаТаблицы.Количество;
			//НоваяСтрока.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения; 
			//НоваяСтрока.Склад = СтрокаТаблицы.Склад;
			//НоваяСтрока.Серия = СтрокаТаблицы.Серия; 
			//НоваяСтрока.РодительНоменклатура = СтрокаТаблицы.РодительНоменклатура;
		КонецЕсли;
	КонецЦикла;
	Возврат Дерево;
	
КонецФункции 

Функция ВыгрузитьТаблицуЗначенийВДеревоЗначенийПоДвумПараметрам(Таблица) Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		//СтрокаГруппировки = Дерево.Строки.Найти(СтрокаТаблицы[КлючСвязи], КлючСтроки,Истина);
		//
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", СтрокаТаблицы["Номенклатура"]);
		ПараметрыОтбора.Вставить("Серия", СтрокаТаблицы["Серия"]);      
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаГруппировки = Дерево.Строки.НайтиСтроки(ПараметрыОтбора, Истина).Получить(0);
		Иначе 
			СтрокаГруппировки = Неопределено;
		КонецЕсли;
		
		Если СтрокаГруппировки = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), СтрокаТаблицы);
		Иначе
			НоваяСтрока = СтрокаГруппировки.Строки.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТаблицы.Номенклатура; 
			НоваяСтрока.ЧистыйВес = СтрокаТаблицы.ЧистыйВес;
			//НоваяСтрока.Характеристика = СтрокаТаблицы.Характеристика; 
			//НоваяСтрока.Количество = СтрокаТаблицы.Количество;
			//НоваяСтрока.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения; 
			//НоваяСтрока.Склад = СтрокаТаблицы.Склад;
			//НоваяСтрока.Серия = СтрокаТаблицы.Серия; 
			//НоваяСтрока.РодительНоменклатура = СтрокаТаблицы.РодительНоменклатура;
		КонецЕсли;
	КонецЦикла;
	Возврат Дерево;
	
КонецФункции

Функция СкладИспользуетОрдернуюСхему(СкладСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СкладСсылка) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.ИспользоватьОрдернуюСхемуПриПоступлении КАК ИспользоватьОрдернуюСхемуПриПоступлении
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СкладСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИспользоватьОрдернуюСхемуПриПоступлении;
	КонецЦикла;
	
	Возврат Ложь;	
	
КонецФункции

Функция ПересчитатьЧистыйВесДляНоменклатуры(СтрокаДерева, Номенклатура, Характеристика, ЛигатурныйВес)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Количество КАК Количество,
	|	НоменклатураДрагоценныеМатериалы.СБ_ПроцентСодержания КАК СБ_ПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.СБ_ИспользоватьПроцентСодержания КАК СБ_ИспользоватьПроцентСодержания
	|ИЗ
	|	Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|ГДЕ
	|	НоменклатураДрагоценныеМатериалы.Ссылка = &Ссылка";
	
	//Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл      
	//
	//	НоваяСтрока = СтрокаДерева.Строки.Добавить();
	//	
	//	НоваяСтрока.РодительНоменклатура = СтрокаДерева.РодительНоменклатура;
	//	НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
	//	НоваяСтрока.Характеристика = Выборка.Характеристика;
	//	НоваяСтрока.Количество = Выборка.КоличествоУпаковокНоменклатураРодитель; 
	//	НоваяСтрока.ЕдиницаИзмерения = СтрокаДерева.ЕдиницаИзмерения;
	//	НоваяСтрока.Склад = СтрокаДерева.Склад;
	//	НоваяСтрока.Серия = СтрокаДерева.Серия;
	//	НоваяСтрока.ЛигатурныйВес = СтрокаДерева.ЛигатурныйВес;
	//	//НоваяСтрока.ЧистыйВес = Выборка.КоличествоДрагоценныйМатериал;
	//	//НоваяСтрока.РодительНоменклатура = НоваяСтрокаРодитель.РодительНоменклатура;
	//	
	//	Если Выборка.СБ_ИспользоватьПроцентСодержания Тогда
	//		//НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * НоваяСтрока.ЛигатурныйВес * Выборка.СБ_ПроцентСодержания;
	//		НоваяСтрока.ЧистыйВес = НоваяСтрока.ЛигатурныйВес * Выборка.СБ_ПроцентСодержания;
	//	Иначе
	//		//НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.КоличествоДрагоценныйМатериал;
	//		НоваяСтрока.ЧистыйВес = Выборка.КоличествоДрагоценныйМатериал;
	//	КонецЕсли;
	//	
	//	СтрокаДерева.ЧистыйВес = СтрокаДерева.ЧистыйВес + НоваяСтрока.ЧистыйВес;
	//	
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

Функция ПолучитьСериюНоменклатуры(Объект, Номенклатура, Характеристика, Количество, СерияИзТЧТовары) Экспорт
	
	Если Номенклатура.ВидНоменклатуры.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям Тогда 
		
		Попытка
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Номенклатура);
			Отбор.Вставить("Характеристика", Характеристика);
			Отбор.Вставить("Количество", Количество);
			НайденныеСтроки = Объект.Серии.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда 
				Возврат НайденныеСтроки[0].Серия;	
			КонецЕсли;     
			
		Исключение
		КонецПопытки;    
		
	КонецЕсли;
	Возврат СерияИзТЧТовары;
	
КонецФункции