
//&НаКлиенте
//Процедура СБ_ТоварыРазмещениеЯчейкаПриИзмененииПосле(Элемент)
//	
//	СБ_ЯчейкаПриИзмененииПроверкаКорректностиИзменения(
//		ТекущийЭлемент.ТекущиеДанные.Ячейка,
//		ТекущийЭлемент.ТекущиеДанные.Упаковка,
//		ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок);
//	
//КонецПроцедуры

//&НаСервере
//Процедура СБ_ЯчейкаПриИзмененииПроверкаКорректностиИзменения(Ячейка, Упаковка, КоличествоУпаковок)
//	
//	Если СБ_РасчетСкладскихЯчеек.СБ_РасчетВместимостиКоличестваТарВЯчейку(Ячейка, Упаковка.Типоразмер, КоличествоУпаковок) < 1 Тогда 
//		
//		ТекстОшибки = "Не удалость провести " + Объект.Ссылка;
//		
//		ВызватьИсключение ТекстОшибки;	
//		
//	КонецЕсли;
//	
//КонецПроцедуры
