
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)    
	
   	#Вставка
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(СкладОтправитель) Тогда 
		СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход, СкладОтправитель);
	КонецЕсли;
	
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(СкладПолучатель) Тогда 
		СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Приход, СкладПолучатель);
	КонецЕсли;
	//Иначе 
	//	СБ_ДрагоценныеМеталлы.Очистить();
	//КонецЕсли;
	#КонецВставки

	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект, РежимЗаписиДокумента.Проведение);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);

	ПеремещениеТоваровЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры

Процедура ПроведениеДрагМеталлов()
	СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход);	
КонецПроцедуры