//&Вместо("НоменклатурныйПланВМенеджерВременныхТаблиц")
//Процедура СБ_НоменклатурныйПланВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, НастройкиДляОтборов, ПользовательскиеОтборы)

//	СхемаКомпоновкиДанных = Обработки.ФормированиеЭтаповПроизводства.ПолучитьМакет("СБ_НоменклатурныйПлан");
//	
//	// Компоновка текста запроса
//	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(
//		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
//	
//	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
//	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
//	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиДляОтборов);
//	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
//	
//	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
//	
//	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
//	
//	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(
//		СхемаКомпоновкиДанных, НастройкиКомпоновки,,,, Ложь);
//		
//	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос;
//	
//	// Выполнение запроса
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК Организация2", "&ОрганизацияПоУмолчанию КАК Организация");
//		Запрос.УстановитьПараметр("ОрганизацияПоУмолчанию", ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию());
//	КонецЕсли;
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетЗатратПоНаправлениямДеятельности")
//		Или Не ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат") Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НаправлениеДеятельности2", "НаправлениеДеятельности");
//	КонецЕсли;
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Характеристика2", "Характеристика");
//	КонецЕсли;
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения")
//		И СтрНайти(ТекстЗапроса, "КАК ПодразделениеДиспетчер,") = 0 Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
//			"НЕОПРЕДЕЛЕНО КАК ПодразделениеДиспетчер2",
//			"План.ЗаказНаПроизводство.Подразделение КАК ПодразделениеДиспетчер");
//	КонецЕсли;
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРаздельныйУчетПоНалогообложению")
//		И Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС")
//		И СтрНайти(ТекстЗапроса, "КАК ЗаказПодДеятельность,") = 0 Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
//			"НЕОПРЕДЕЛЕНО КАК ЗаказПодДеятельность2",
//			"План.ЗаказНаПроизводство.ЗаказПодДеятельность КАК ЗаказПодДеятельность");
//	КонецЕсли;
//	
//	УправлениеПроизводством.ПодстановкаАктуальногоРегистраГрафика(ТекстЗапроса);
//	
//	СхемаЗапроса = Новый СхемаЗапроса;
//	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
//	СхемаЗапроса.ПакетЗапросов[0].ТаблицаДляПомещения = "НоменклатурныйПлан";
//	
//	ИндексыСписком = СтрРазделить("Спецификация,Организация,Партнер,Договор,НаправлениеДеятельности,ПодразделениеДиспетчер,ЗаказПодДеятельность,ХозяйственнаяОперация", ",");
//	Для каждого Поле Из ИндексыСписком Цикл
//		СхемаЗапроса.ПакетЗапросов[0].Индекс.Добавить(Поле);
//	КонецЦикла;
//	
//	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
//	
//	ТекстыОтборов = Новый Массив;
//	Для каждого ВыражениеСхемы Из СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор Цикл
//		ТекстыОтборов.Добавить("" + ВыражениеСхемы);
//	КонецЦикла;
//	
//	ПользовательскиеОтборы = Новый Структура;
//	
//	Отборы = Новый ТаблицаЗначений;
//	Отборы.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
//	Отборы.Колонки.Добавить("Значение");
//	Отборы.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка"));
//	
//	Для Индекс = -МакетКомпоновкиДанных.ЗначенияПараметров.Количество() + 1 По 0 Цикл
//		
//		ПараметрКомпоновки = МакетКомпоновкиДанных.ЗначенияПараметров[-Индекс];
//		Запрос.УстановитьПараметр(ПараметрКомпоновки.Имя, ПараметрКомпоновки.Значение);
//		
//		// Кеширование отборов для последующего чтения детальных записей
//		Для ИндексТекст = 0 По ТекстыОтборов.ВГраница() Цикл
//			Если СтрНайти(ТекстыОтборов[ИндексТекст], "&" + ПараметрКомпоновки.Имя) Тогда
//				НоваяСтрока = Отборы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрКомпоновки, "Имя, Значение");
//				НоваяСтрока.Текст = ТекстыОтборов[ИндексТекст];
//				ТекстыОтборов.Удалить(ИндексТекст);
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	СоединенияСДопРеквизитами = Новый ТаблицаЗначений;
//	СоединенияСДопРеквизитами.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка"));
//	СоединенияСДопРеквизитами.Колонки.Добавить("Псевдоним", Новый ОписаниеТипов("Строка"));
//	СоединенияСДопРеквизитами.Колонки.Добавить("Условие", Новый ОписаниеТипов("Строка"));
//	
//	ПараметрыСоединенийСДопРеквизитами = Новый Соответствие;
//	
//	Для каждого Источник Из СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники Цикл
//		Если ТипЗнч(Источник.Источник) <> Тип("ТаблицаСхемыЗапроса")
//			ИЛИ Источник.Источник.ИмяТаблицы <> "РегистрСведений.СтруктураЗаказа" Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		Для каждого Соединение Из Источник.Соединения Цикл
//			Если ТипЗнч(Соединение.Источник.Источник) <> Тип("ТаблицаСхемыЗапроса")
//				ИЛИ СтрНайти(Соединение.Источник.Источник.ИмяТаблицы, "ДополнительныеРеквизиты") = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = СоединенияСДопРеквизитами.Добавить();
//			НоваяСтрока.ИмяТаблицы = Соединение.Источник.Источник.ИмяТаблицы;
//			НоваяСтрока.Псевдоним = Соединение.Источник.Источник.Псевдоним;
//			НоваяСтрока.Условие = Соединение.Условие;
//			
//			НомерСимвола = СтрНайти(Соединение.Условие, "&");
//			Если НомерСимвола <> 0 Тогда
//				ИмяПараметра = Прав(Соединение.Условие, СтрДлина(Соединение.Условие) - НомерСимвола);
//				Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
//					Если Параметр.Имя = ИмяПараметра Тогда
//						ПараметрыСоединенийСДопРеквизитами.Вставить(Параметр.Имя, Параметр.Значение);
//						Прервать;
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЦикла;
//		
//		Прервать;
//	КонецЦикла;
//	
//	ПользовательскиеОтборы.Вставить("Отборы", Отборы);
//	ПользовательскиеОтборы.Вставить("СоединенияСДопРеквизитами", СоединенияСДопРеквизитами);
//	ПользовательскиеОтборы.Вставить("ПараметрыСоединенийСДопРеквизитами", ПараметрыСоединенийСДопРеквизитами);
//	
//	Запрос.ВыполнитьПакет();
//	
//КонецПроцедуры
