&НаСервере
Процедура ЗаполнитьПоПланамПроизводства()
	
	ДанныеЗаполнения = ПолучитьДанныеПланирования();
	
	Для Каждого Строка из ДанныеЗаполнения Цикл
		
		НоваяСтрока = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла
	
КонецПроцедуры

Функция ПолучитьДанныеПланирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыПотребленияМатериаловОбороты.Номенклатура КАК Номенклатура,
		|	ПланыПотребленияМатериаловОбороты.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЭтапыПроизводства.Подразделение.ПодразделениеДиспетчер
		|			ТОГДА ЭтапыПроизводства.Подразделение
		|		ИНАЧЕ ЭтапыПроизводства.Подразделение.Родитель
		|	КОНЕЦ КАК Подразделение,
		|	ПланыПотребленияМатериаловОбороты.КоличествоОборот КАК КоличествоОборот,
		|	ВЫБОР &Периодичность
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, НЕДЕЛЯ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, ДЕКАДА, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, МЕСЯЦ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, КВАРТАЛ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, ПОЛУГОДИЕ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, ГОД, -&СмещениеПериода)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПланыПотребленияМатериаловОбороты.ДатаПроизводства, ДЕНЬ, -&СмещениеПериода)
		|	КОНЕЦ КАК Период,
		|	ПланыПотребленияМатериаловОбороты.ПланПроизводства КАК ПланПроизводства,
		|	СпецификацииИзделий.Спецификация КАК Спецификация,
		|	ЭтапыПроизводства.Ссылка КАК Ссылка,
		|	ПланыПотребленияМатериаловОбороты.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
		|	ПланыПотребленияМатериаловОбороты.Склад КАК Склад
		|ПОМЕСТИТЬ Задел
		|ИЗ
		|	РегистрНакопления.ПланыПотребленияМатериалов.Обороты(
		|			,
		|			,
		|			Авто,
		|			Номенклатура.ВидНоменклатуры В ИЕРАРХИИ (&ВидНоменклатуры)
		|				И Сценарий = &СценарийПлана) КАК ПланыПотребленияМатериаловОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|			ПО СпецификацииИзделий.Спецификация = ЭтапыПроизводства.Владелец
		|				И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|				И (ЭтапыПроизводства.ПометкаУдаления = ЛОЖЬ)
		|		ПО ПланыПотребленияМатериаловОбороты.Номенклатура = СпецификацииИзделий.Номенклатура
		|			И (НЕ СпецификацииИзделий.ПобочныйВыход)
		|			И (СпецификацииИзделий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|			И ПланыПотребленияМатериаловОбороты.Характеристика = СпецификацииИзделий.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.Подразделение КАК Подразделение,
		|	ВложенныйЗапрос.Сценарий КАК Сценарий,
		|	ВложенныйЗапрос.Статус КАК Статус,
		|	ВложенныйЗапрос.Спецификация КАК Спецификация,
		|	ВложенныйЗапрос.Склад КАК Склад
		|ПОМЕСТИТЬ ВР_Спецификации
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР &Периодичность
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, НЕДЕЛЯ), НЕДЕЛЯ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕКАДА), ДЕКАДА, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, МЕСЯЦ), МЕСЯЦ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, КВАРТАЛ), КВАРТАЛ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ПОЛУГОДИЕ), ПОЛУГОДИЕ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ГОД), ГОД, -&СмещениеПериода)
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕНЬ), ДЕНЬ, -&СмещениеПериода)
		|		КОНЕЦ КАК Период,
		|		Задел.Номенклатура КАК Номенклатура,
		|		Задел.Характеристика КАК Характеристика,
		|		Задел.КоличествоОборот КАК Количество,
		|		ВЫБОР
		|			КОГДА ЭтапыПроизводства.Подразделение.ПодразделениеДиспетчер
		|				ТОГДА ЭтапыПроизводства.Подразделение
		|			ИНАЧЕ ЭтапыПроизводства.Подразделение.Родитель
		|		КОНЕЦ КАК Подразделение,
		|		&СценарийПлана КАК Сценарий,
		|		&Статус КАК Статус,
		|		СпецификацииИзделий.Спецификация КАК Спецификация,
		|		Задел.Склад КАК Склад
		|	ИЗ
		|		Задел КАК Задел
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|				ПО СпецификацииИзделий.Спецификация = ЭтапыПроизводства.Владелец
		|					И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|			ПО Задел.Номенклатура = СпецификацииИзделий.Номенклатура
		|				И Задел.Характеристика = СпецификацииИзделий.Характеристика
		|				И (НЕ СпецификацииИзделий.ПобочныйВыход)
		|				И (СпецификацииИзделий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|	ГДЕ
		|		Задел.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.Сценарий,
		|	ВложенныйЗапрос.Статус,
		|	ВложенныйЗапрос.Спецификация,
		|	ВложенныйЗапрос.Склад
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР &Периодичность
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, НЕДЕЛЯ), НЕДЕЛЯ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕКАДА), ДЕКАДА, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, МЕСЯЦ), МЕСЯЦ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, КВАРТАЛ), КВАРТАЛ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ПОЛУГОДИЕ), ПОЛУГОДИЕ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ГОД), ГОД, -&СмещениеПериода)
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕНЬ), ДЕНЬ, -&СмещениеПериода)
		|		КОНЕЦ КАК Период,
		|		Задел.Номенклатура КАК Номенклатура,
		|		Задел.Характеристика КАК Характеристика,
		|		Задел.КоличествоОборот КАК Количество,
		|		ВЫБОР
		|			КОГДА ЭтапыПроизводства.Подразделение.ПодразделениеДиспетчер
		|				ТОГДА ЭтапыПроизводства.Подразделение
		|			ИНАЧЕ ЭтапыПроизводства.Подразделение.Родитель
		|		КОНЕЦ КАК Подразделение,
		|		&СценарийПлана КАК Сценарий,
		|		&Статус КАК Статус,
		|		СпецификацииИзделий.Спецификация КАК Спецификация,
		|		Задел.Склад КАК Склад
		|	ИЗ
		|		Задел КАК Задел
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|				ПО СпецификацииИзделий.Спецификация = ЭтапыПроизводства.Владелец
		|					И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|			ПО Задел.Номенклатура = СпецификацииИзделий.Номенклатура
		|				И (Задел.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|				И (СпецификацииИзделий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|				И (НЕ СпецификацииИзделий.ПобочныйВыход)
		|	ГДЕ
		|		Задел.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.Сценарий,
		|	ВложенныйЗапрос.Статус,
		|	ВложенныйЗапрос.Спецификация,
		|	ВложенныйЗапрос.Склад
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР &Периодичность
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, НЕДЕЛЯ), НЕДЕЛЯ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕКАДА), ДЕКАДА, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, МЕСЯЦ), МЕСЯЦ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, КВАРТАЛ), КВАРТАЛ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ПОЛУГОДИЕ), ПОЛУГОДИЕ, -&СмещениеПериода)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ГОД), ГОД, -&СмещениеПериода)
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задел.Период, ДЕНЬ), ДЕНЬ, -&СмещениеПериода)
		|		КОНЕЦ КАК Период,
		|		Задел.Номенклатура КАК Номенклатура,
		|		Задел.Характеристика КАК Характеристика,
		|		Задел.КоличествоОборот КАК Количество,
		|		ВЫБОР
		|			КОГДА ЭтапыПроизводства.Подразделение.ПодразделениеДиспетчер
		|				ТОГДА ЭтапыПроизводства.Подразделение
		|			ИНАЧЕ ЭтапыПроизводства.Подразделение.Родитель
		|		КОНЕЦ КАК Подразделение,
		|		&СценарийПлана КАК Сценарий,
		|		&Статус КАК Статус,
		|		СпецификацииИзделий.Спецификация КАК Спецификация,
		|		Задел.Склад КАК Склад
		|	ИЗ
		|		Задел КАК Задел
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|				ПО СпецификацииИзделий.Спецификация = ЭтапыПроизводства.Владелец
		|					И (ЭтапыПроизводства.НомерЭтапа = 1)
		|			ПО Задел.Номенклатура = СпецификацииИзделий.Номенклатура
		|				И (НЕ СпецификацииИзделий.ПобочныйВыход)
		|				И (СпецификацииИзделий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|	ГДЕ
		|		Задел.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задел.Номенклатура КАК Номенклатура,
		|	Задел.Характеристика КАК Характеристика,
		|	СУММА(ВЫРАЗИТЬ(Задел.КоличествоОборот / СпецификацииИзделий.КоличествоУпаковокНаЕдиницуПартииЗапуска * ВЫБОР
		|				КОГДА ЭтапыПроизводства.ЕдиницаИзмеренияДлительностиЭтапа = ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Секунда)
		|					ТОГДА ЭтапыПроизводства.ДлительностьЭтапа / 60 / 60 / 24
		|				КОГДА ЭтапыПроизводства.ЕдиницаИзмеренияДлительностиЭтапа = ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Минута)
		|					ТОГДА ЭтапыПроизводства.ДлительностьЭтапа / 60 / 24
		|				КОГДА ЭтапыПроизводства.ЕдиницаИзмеренияДлительностиЭтапа = ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час)
		|					ТОГДА ЭтапыПроизводства.ДлительностьЭтапа / 24
		|				ИНАЧЕ ЭтапыПроизводства.ДлительностьЭтапа
		|			КОНЕЦ + 0.5 КАК ЧИСЛО(15, 0))) КАК Длительность,
		|	ВЫБОР &Периодичность
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, НЕДЕЛЯ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ДЕКАДА, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, МЕСЯЦ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, КВАРТАЛ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ПОЛУГОДИЕ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ГОД, -&СмещениеПериода)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Задел.Период, ДЕНЬ, -&СмещениеПериода)
		|	КОНЕЦ КАК Период,
		|	Задел.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
		|	Задел.Склад КАК Склад
		|ПОМЕСТИТЬ ВР_Длительность
		|ИЗ
		|	Задел КАК Задел
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|			ПО СпецификацииИзделий.Спецификация = ЭтапыПроизводства.Владелец
		|				И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|		ПО Задел.Номенклатура = СпецификацииИзделий.Номенклатура
		|			И (НЕ СпецификацииИзделий.ПобочныйВыход)
		|			И (СпецификацииИзделий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|			И Задел.Характеристика = СпецификацииИзделий.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	Задел.Номенклатура,
		|	Задел.Характеристика,
		|	ВЫБОР &Периодичность
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, НЕДЕЛЯ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ДЕКАДА, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, МЕСЯЦ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, КВАРТАЛ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ПОЛУГОДИЕ, -&СмещениеПериода)
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Задел.Период, ГОД, -&СмещениеПериода)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Задел.Период, ДЕНЬ, -&СмещениеПериода)
		|	КОНЕЦ,
		|	Задел.ПодразделениеДиспетчер,
		|	Задел.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланыВыпускаИзделийОбороты.ПодразделениеДиспетчер КАК Подразделение,
		|	ПланыВыпускаИзделийОбороты.Номенклатура КАК Номенклатура,
		|	ПланыВыпускаИзделийОбороты.Характеристика КАК Характеристика,
		|	ПланыВыпускаИзделийОбороты.ДатаПроизводства КАК Период,
		|	ПланыВыпускаИзделийОбороты.КоличествоОборот КАК Количество,
		|	&СкладГП КАК Склад
		|ПОМЕСТИТЬ Выпуск
		|ИЗ
		|	РегистрНакопления.ПланыВыпускаИзделий.Обороты(
		|			,
		|			,
		|			,
		|			Номенклатура.ВидНоменклатуры В ИЕРАРХИИ (&ВидНоменклатуры)
		|				И Сценарий = &СценарийПлана
		|				И ВидПлана = &ВидПлана) КАК ПланыВыпускаИзделийОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Спецификации.Подразделение КАК Подразделение,
		|	ВР_Спецификации.Номенклатура КАК Номенклатура,
		|	ВР_Спецификации.Характеристика КАК Характеристика,
		|	ВЫРАЗИТЬ(ДОБАВИТЬКДАТЕ(ВР_Спецификации.Период, ДЕНЬ, -ВР_Длительность.Длительность) КАК ДАТА) КАК Период,
		|	ВР_Спецификации.Количество КАК Количество,
		|	ВР_Длительность.Склад КАК Склад
		|ПОМЕСТИТЬ ПФ
		|ИЗ
		|	ВР_Спецификации КАК ВР_Спецификации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Длительность КАК ВР_Длительность
		|		ПО ВР_Спецификации.Период = ВР_Длительность.Период
		|			И ВР_Спецификации.Номенклатура = ВР_Длительность.Номенклатура
		|			И ВР_Спецификации.Характеристика = ВР_Длительность.Характеристика
		|			И ВР_Спецификации.Склад = ВР_Длительность.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выпуск.Подразделение КАК Подразделение,
		|	Выпуск.Номенклатура КАК Номенклатура,
		|	Выпуск.Характеристика КАК Характеристика,
		|	Выпуск.Период КАК Период,
		|	Выпуск.Количество КАК Количество,
		|	Выпуск.Склад КАК Склад
		|ПОМЕСТИТЬ Объединение
		|ИЗ
		|	Выпуск КАК Выпуск
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПФ.Подразделение,
		|	ПФ.Номенклатура,
		|	ПФ.Характеристика,
		|	ПФ.Период,
		|	ПФ.Количество,
		|	ПФ.Склад
		|ИЗ
		|	ПФ КАК ПФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Объединение.Подразделение КАК Подразделение,
		|	Объединение.Номенклатура КАК Номенклатура,
		|	Объединение.Характеристика КАК Характеристика,
		|	Объединение.Период КАК Период,
		|	СУММА(Объединение.Количество) КАК Количество,
		|	Объединение.Склад КАК Склад,
		|	РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ) КАК Разность,
		|	ВЫРАЗИТЬ(Объединение.Количество / ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ) = 0
		|				ТОГДА 1
		|			ИНАЧЕ РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ)
		|		КОНЕЦ + 0.499999999999999 КАК ЧИСЛО(15, 0)) КАК Средний
		|ПОМЕСТИТЬ Среднесуточное
		|ИЗ
		|	Объединение КАК Объединение
		|
		|СГРУППИРОВАТЬ ПО
		|	Объединение.Номенклатура,
		|	Объединение.Период,
		|	Объединение.Характеристика,
		|	Объединение.Склад,
		|	Объединение.Подразделение,
		|	РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ),
		|	ВЫРАЗИТЬ(Объединение.Количество / ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ) = 0
		|				ТОГДА 1
		|			ИНАЧЕ РАЗНОСТЬДАТ(&ДатаОтсчета, Объединение.Период, ДЕНЬ)
		|		КОНЕЦ + 0.499999999999999 КАК ЧИСЛО(15, 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроизводственныйКалендарь.ДатаГрафика КАК ДатаГрафика
		|ПОМЕСТИТЬ ВТ_ДатыКалендаря
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК ПроизводственныйКалендарь
		|ГДЕ
		|	ПроизводственныйКалендарь.ДатаГрафика МЕЖДУ &ДатаОтсчета И &ОкончаниеПериода
		|	И ПроизводственныйКалендарь.ДеньВключенВГрафик = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственныйКалендарь.ДатаГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Среднесуточное.Номенклатура КАК Номенклатура,
		|	Среднесуточное.Характеристика КАК Характеристика,
		|	Среднесуточное.Период КАК ДатаПотребности,
		|	СУММА(Среднесуточное.Количество) КАК Количество,
		|	СУММА(Среднесуточное.Количество) КАК КоличествоУпаковок,
		|	Среднесуточное.Склад КАК Склад,
		|	Среднесуточное.Средний КАК Средний
		|ИЗ
		|	Среднесуточное КАК Среднесуточное
		|ГДЕ
		|	Среднесуточное.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	Среднесуточное.Характеристика,
		|	Среднесуточное.Номенклатура,
		|	Среднесуточное.Склад,
		|	Среднесуточное.Период,
		|	Среднесуточное.Средний
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПотребности,
		|	Номенклатура,
		|	Характеристика,
		|	Количество,
		|	Склад
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Изделия"));
	Запрос.УстановитьПараметр("ВидПлана", Справочники.ВидыПланов.НайтиПоНаименованию("Готовая продукция"));
	Запрос.УстановитьПараметр("ДатаОтсчета", Объект.Дата);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.День);
	Запрос.УстановитьПараметр("СкладГП", Справочники.Склады.НайтиПоНаименованию("Склад сбыта"));
	Запрос.УстановитьПараметр("СмещениеПериода", 0);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыПланов.Утвержден);
	Запрос.УстановитьПараметр("СценарийПлана", Справочники.СценарииТоварногоПланирования.НайтиПоНаименованию("Производство по цехам")); 
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

&НаСервере
Процедура СБ_ЗаполнитьПоПлануПослеНаСервере()
	
	Объект.Продукция.Очистить();
	ЗаполнитьПоПланамПроизводства();
	//ЗаполнитьСпецификациюВТабличнойЧасти(Объект.Продукция);
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ЗаполнитьПоПлануПосле(Команда)
	
	Объект.Продукция.Очистить();
	СБ_ЗаполнитьПоПлануПослеНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура SB1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

