
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда 
		ПроведениеДрагМеталлов();	                                                  
	Иначе 
		СБ_ДрагоценныеМеталлы.Очистить();
	КонецЕсли;
	#КонецВставки
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПроведениеДрагМеталлов()
	СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Расход);	
КонецПроцедуры