Процедура ПроведениеДрагМеталлов()
	СБ_РаботаСДрагоценнымиМеталлами.ПроведениеДрагоценныеМеталлы(ЭтотОбъект, ВидДвиженияНакопления.Приход);	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	Если НЕ СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда 
		ПроведениеДрагМеталлов();	                                                  
	Иначе 
		СБ_ДрагоценныеМеталлы.Очистить();
	КонецЕсли;
	#КонецВставки
	
	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковСобственныхТоваров Тогда
		ПараметрыРегистрации = Документы.ВводОстатковТоваров.ИнициализироватьПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
		УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриПроведении(ПараметрыРегистрации);
	КонецЕсли;

	ВводОстатковЛокализация.ВводОстатковТоваровОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры
