
&НаКлиенте
Процедура СБ_ПоставщикиПоТоварнымКатегориямПосле(Команда)
	
	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Номенклатура", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("НоменклатураТоварнаяКатегория", Объект.КатегорияМатериала);
	ПараметрыОткрытия.Вставить("НоменклатураГруппаНоменклатуры", Объект.Родитель);   
	//ПараметрыОткрытия.Вставить("ГруппаНоменклатуры", Объект.Родитель); 
	//ПараметрыОткрытия.Вставить("КатегорияМатериала", Объект.КатегорияМатериала);

	ОткрытьФорму("РегистрСведений.СБ_ПоставщикиПоТоварнымКатегориям.ФормаСписка", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_СБ_ИспользоватьПроцентСодержанияПриИзмененииПосле(Элемент)
	
	Объект.СБ_ИспользоватьПроцентСодержания = (ПроцентСодержанияИлиВес = 1);
	
	Если Объект.СБ_ИспользоватьПроцентСодержания Тогда 
		ПроцентСодержанияИлиВес = 1; 
		ЭтаФорма.Элементы.ДрагоценныеМатериалыСБ_ПроцентСодержания.Видимость = Истина;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыКоличество.Видимость = Ложь;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыЕдиницаИзмерения.Видимость = Ложь;
	Иначе
		ПроцентСодержанияИлиВес = 2;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыСБ_ПроцентСодержания.Видимость = Ложь;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыКоличество.Видимость = Истина;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыЕдиницаИзмерения.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СБ_ПолучитьНастройкуПроцентСодержанияНаСервере(ОбъектСсылка)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.СБ_ИспользоватьПроцентСодержания КАК СБ_ИспользоватьПроцентСодержания
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.СБ_ИспользоватьПроцентСодержания;
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СБ_ПриОткрытииПосле(Отказ)                                      
	
	Если СБ_ПолучитьНастройкуПроцентСодержанияНаСервере(Объект.Ссылка) Тогда 
		ПроцентСодержанияИлиВес = 1; 
		ЭтаФорма.Элементы.ДрагоценныеМатериалыСБ_ПроцентСодержания.Видимость = Истина;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыКоличество.Видимость = Ложь;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыЕдиницаИзмерения.Видимость = Ложь;
	Иначе
		ПроцентСодержанияИлиВес = 2;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыСБ_ПроцентСодержания.Видимость = Ложь;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыКоличество.Видимость = Истина;
		ЭтаФорма.Элементы.ДрагоценныеМатериалыЕдиницаИзмерения.Видимость = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТЧДрагМеталлы Из Объект.ДрагоценныеМатериалы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧДрагМеталлы.Количество) Тогда
			СтрокаТЧДрагМеталлы.Количество = СтрокаТЧДрагМеталлы.СБ_ПроцентСодержания;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДрагоценныеМатериалыСБ_ПроцентСодержанияПриИзмененииПосле(Элемент)

	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Количество = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СБ_ПроцентСодержания; 
	
КонецПроцедуры
