
&НаКлиенте
Процедура СБ_ЗаполнитьКооперациюПосле(Команда)
	ОбработчикЗакрытия = ?(ОбработчикЗакрытия <> Неопределено, ОбработчикЗакрытия,
		Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборКварталов", Ложь);
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыФормы,, УникальныйИдентификатор,,,
		ОбработчикЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	Если ВыбранныйПериод <> Неопределено Тогда 
		
		СопровождающийТекст = НСтр("ru = 'Выполняется обработка данных'");
		Обработчик = Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ЭтотОбъект, СопровождающийТекст);
		
		ДлительнаяОперация = СБ_ЗаполнитьКооперациюПослеНаСервере(ВыбранныйПериод.НачалоПериода, УникальныйИдентификатор);
		Если ДлительнаяОперация = Неопределено Тогда
			ИдентификаторФоновогоЗадания = Неопределено;
			Возврат;
		КонецЕсли;
		ИдентификаторФоновогоЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма); 
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет обработка кооперации'");
		
		ПараметрыОжидания.Интервал  = 2;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция СБ_ЗаполнитьКооперациюПослеНаСервере(ВыбранныйПериод, УникальныйИдентификатор)
	КлючФоновогоЗадания = "СБ_СоздатьЗаполнитьДокументыКооперации";
	Отбор = Новый Структура("Ключ, Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
	АктивныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	КоличествоАктивных = АктивныеФоновыеЗадания.Количество();
	Если КоличествоАктивных > 0 Тогда
		Для Каждого ФоновоеЗадание Из АктивныеФоновыеЗадания Цикл
			Если ФоновоеЗадание.РегламентноеЗадание <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗадание.УникальныйИдентификатор);
		КонецЦикла;
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru = 'Создание и заполнение документов кооперации");
	ВыполняемыйМетод = "Документы.ПланПроизводства.СБ_СоздатьЗаполнитьДокументыКооперации";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ВыполняемыйМетод,
	ВыбранныйПериод);
	
	Возврат СтруктураФоновогоЗадания;
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияДлительнойОперации(Операция, СопровождающийТекст) Экспорт
	Если Операция.Статус = "Выполняется" Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Выполняется обработка'"), , СопровождающийТекст, БиблиотекаКартинок.ДлительнаяОперация16);
	ИначеЕсли Операция.Статус = "Выполнено" Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Успешное завершение'"), , СопровождающийТекст, БиблиотекаКартинок.Успешно32);
	Иначе
		ПоказатьПредупреждение(, Операция.КраткоеПредставлениеОшибки);
	КонецЕсли;
КонецПроцедуры