////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ДЕРЕВОМ ЗНАЧЕНИЙ

// Функция формирует значение нового ключа строки табличной части.
//
// Параметры:
// Дерево - дерево значений
//
Функция ПолучитьНовыйКлючСтрокиДерева(Дерево, СписокКлючей = Неопределено) Экспорт
	
	Если СписокКлючей = Неопределено Тогда
		СписокКлючей = Новый СписокЗначений;
		СписокКлючей.Добавить(0);
	КонецЕсли;
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		СписокКлючей.Добавить(СтрокаДерева.КлючСтроки);
		ПолучитьНовыйКлючСтрокиДерева(СтрокаДерева, СписокКлючей);
		СписокКлючей.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		МаксКлюч = СписокКлючей[0].Значение + 1;
	КонецЦикла;
	Возврат МаксКлюч;
	
КонецФункции // ПолучитьНовыйКлючСтрокиДерева()

// Процедура обновляет ключи связи в дереве значений
//
Процедура ОбновитьКлючиСвязиВДеревеЗначений(Дерево) Экспорт
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Попытка
			СтрокаДерева.КлючСвязи = СтрокаДерева.Родитель.КлючСтроки;
		Исключение
			СтрокаДерева.КлючСвязи = 0;
		КонецПопытки;
		ОбновитьКлючиСвязиВДеревеЗначений(СтрокаДерева);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьКлючиСвязиВДеревеЗначений()

// Процедура обновляет ключи связи в дереве значений
//
Процедура ОбновитьКлючиСтрокВДеревеЗначений(Дерево, КлючСтроки = 1) Экспорт
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		СтрокаДерева.КлючСтроки = КлючСтроки;
		КлючСтроки = КлючСтроки + 1;
		ОбновитьКлючиСтрокВДеревеЗначений(СтрокаДерева, КлючСтроки);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьКлючиСтрокВДеревеЗначений()

// Процедура выгружает данные из дерева значений в таблицу значений
// данные выгружаются только в таблицу со сходным набором реквизитов
//
Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено) Экспорт
	
	Если Таблица = Неопределено Тогда
		Таблица = Новый ТаблицаЗначений;
		Для Каждого Колонка Из Дерево.Колонки Цикл
			Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
	КонецЕсли;
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
		ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
	КонецЦикла; 
	Возврат Таблица;
	
КонецФункции //ВыгрузитьДеревоЗначенийВТаблицуЗначений()

// Процедура выгружает данные из таблицы значений в дерево значений
// данные выгружаются только в таблицу со сходным набором реквизитов
//
// Параметры:
//
// КлючСтроки - имя колонки ТаблицыЗначений - уникальный идентификатор
// КлючСвязи - имя колонки ТаблицыЗначений - указатель привязки к строке Дерева,
// своего рода указатель на "Родителя"
//
Функция ВыгрузитьТаблицуЗначенийВДеревоЗначений(Таблица, КлючСтроки = "КлючСтроки", КлючСвязи = "КлючСвязи") Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаГруппировки = Дерево.Строки.Найти(СтрокаТаблицы[КлючСвязи], КлючСтроки,Истина);
		Если СтрокаГруппировки = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), СтрокаТаблицы);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаГруппировки.Строки.Добавить(), СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Возврат Дерево;
	
КонецФункции //ВыгрузитьТаблицуЗначенийВДеревоЗначений()

// Процедура устанавливает значение во всем дереве значений
//
Процедура УстановитьЗначениеКолонкиДерева(Дерево, Колонка, Значение) Экспорт
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		СтрокаДерева[Колонка] = Значение;
		УстановитьЗначениеКолонкиДерева(СтрокаДерева, Колонка, Значение);
	КонецЦикла;
	
КонецПроцедуры //УстановитьЗначениеКолонкиДерева()

// Процедура копирует подчиненные строки дерева значений
//
Процедура СкопироватьПодчиненныеСтроки(СтрокаПриемник, СтрокаИсточник)
	
	Для каждого Строка Из СтрокаИсточник.Строки Цикл
		НоваяСтрока = СтрокаПриемник.Строки.Добавить();
		НоваяСтрока.КлючСвязи = СтрокаПриемник.КлючСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		СкопироватьПодчиненныеСтроки(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры // СкопироватьПодчиненныеСтроки()

// Процедура переносит выделенные строки дерева значений в указанную ветку
//
Процедура ПеренестиСтрокиДереваЗначений(СтрокаПриемник, ВыделенныеСтроки) Экспорт
	
	Если НЕ СтрокаПриемник = Неопределено Тогда
		МассивСтрок = Новый Массив;
		Для Каждого СтрокаПереноса Из ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(СтрокаПереноса);
			НоваяСтрока = СтрокаПриемник.Строки.Добавить();
			СкопироватьПодчиненныеСтроки(НоваяСтрока, СтрокаПереноса);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПереноса);
			НоваяСтрока.КлючСвязи = СтрокаПриемник.КлючСтроки;
		КонецЦикла;
		Для Каждого СтрокаДерева Из МассивСтрок Цикл
			Если СтрокаДерева.Родитель = Неопределено Тогда
				СтрокаДерева.Строки.Удалить(СтрокаДерева);
			Иначе
				СтрокаДерева.Родитель.Строки.Удалить(СтрокаДерева);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ПеренестиСтрокиДереваЗначений()

Функция УдалитьДублиИзТаблицыЗначений(ТаблицаЗначений, ИсключитьПоля = "") Экспорт
	
	ИсключитьПоля =
	"НомерСтроки,ЗаказНаЗапуск,ОбеспечениеПартии,ЗаказНаЗапускЭтапы"; 
	
	Если ТаблицаЗначений = Неопределено
		Или ТаблицаЗначений.Количество() = 0 Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	
	ПоляСвертки = "";
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		
		Если НЕ ПустаяСтрока(ИсключитьПоля)
			И Найти(
			"," + СтрЗаменить(ИсключитьПоля, " ", "") + ",",
			"," + Колонка.Имя + ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ПоляСвертки) Тогда
			ПоляСвертки = ПоляСвертки + ",";
		КонецЕсли;
		
		ПоляСвертки = ПоляСвертки + Колонка.Имя;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ПоляСвертки) Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаЗначений.Свернуть(ПоляСвертки);
	
	Возврат ТаблицаЗначений;
	
КонецФункции
