
&НаКлиенте
&ИзменениеИКонтроль("ДинамическийСписокФильтрыПриАктивизацииСтроки")
Процедура СБ_ДинамическийСписокФильтрыПриАктивизацииСтроки(Элемент)

	Если Элемент.Имя = "БизнесРегионы" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаБизнесРегионы Тогда
		Возврат;
	ИначеЕсли Элемент.Имя = "ГруппыДоступаПартнеров" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаГруппыДоступа Тогда
		Возврат;
	ИначеЕсли Элемент.Имя = "Менеджеры" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаМенеджеры Тогда
		Возврат;
	ИначеЕсли Элемент.Имя = "Свойства" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаСвойства Тогда
		Возврат;
	ИначеЕсли Элемент.Имя = "Категории" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаКатегории Тогда
		Возврат;
		
	#Вставка
	ИначеЕсли Элемент.Имя = "ТоварныеКатегории" И Элементы.СтраницыТипФильтра.ТекущаяСтраница <> Элементы.СтраницаТоварныеКатегории Тогда
		Возврат;
	#КонецВставки 
	
	КонецЕсли;

	Если НеОтрабатыватьАктивизациюПанелиНавигации Тогда
		НеОтрабатыватьАктивизациюПанелиНавигации = Ложь;
	Иначе
		Если Элемент.Имя = "БизнесРегионы" И ТекущееЗначениеФильтра = Элементы.БизнесРегионы.ТекущаяСтрока Тогда
			Возврат;
		ИначеЕсли Элемент.Имя = "ГруппыДоступаПартнеров" И ТекущееЗначениеФильтра = Элементы.ГруппыДоступаПартнеров.ТекущаяСтрока Тогда
			Возврат;
		ИначеЕсли Элемент.Имя = "Менеджеры" И ТекущееЗначениеФильтра = Элементы.Менеджеры.ТекущаяСтрока Тогда
			Возврат;
		ИначеЕсли Элемент.Имя = "Свойства" И ТекущееЗначениеФильтра = Свойства.НайтиПоИдентификатору(Элементы.Свойства.ТекущаяСтрока) Тогда
			Возврат;
		ИначеЕсли Элемент.Имя = "Категории" И ТекущееЗначениеФильтра = Категории.НайтиПоИдентификатору(Элементы.Категории.ТекущаяСтрока) Тогда
			Возврат;
			
		#Вставка
		ИначеЕсли Элемент.Имя = "ТоварныеКатегории" И ТекущееЗначениеФильтра = Элементы.ТоварныеКатегории.ТекущаяСтрока Тогда
			Возврат;
		#КонецВставки	
			
		КонецЕсли;

		ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиДинамическогоСписка",0.2,Истина);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 

	ЭтаФорма.Список.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                               |	СБ_ПоставщикиПоТоварнымКатегориям.Контрагент КАК Контрагент
	                               |ПОМЕСТИТЬ ОтборПоТоварнойКатегорииВТ
	                               |ИЗ
	                               |	РегистрСведений.СБ_ПоставщикиПоТоварнымКатегориям КАК СБ_ПоставщикиПоТоварнымКатегориям
	                               |ГДЕ
	                               |	СБ_ПоставщикиПоТоварнымКатегориям.ТоварнаяКатегория = &ТоварнаяКатегория
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	СправочникПартнеры.Ссылка КАК Ссылка,
	                               |	СправочникПартнеры.ПометкаУдаления КАК ПометкаУдаления,
	                               |	СправочникПартнеры.Предопределенный КАК Предопределенный,
	                               |	СправочникПартнеры.Родитель КАК Родитель,
	                               |	СправочникПартнеры.Код КАК Код,
	                               |	СправочникПартнеры.Наименование КАК Наименование,
	                               |	СправочникПартнеры.БизнесРегион КАК БизнесРегион,
	                               |	СправочникПартнеры.ГруппаДоступа КАК ГруппаДоступа,
	                               |	СправочникПартнеры.ДатаРегистрации КАК ДатаРегистрации,
	                               |	СправочникПартнеры.Клиент КАК Клиент,
	                               |	СправочникПартнеры.Комментарий КАК Комментарий,
	                               |	СправочникПартнеры.Конкурент КАК Конкурент,
	                               |	СправочникПартнеры.НаименованиеПолное КАК НаименованиеПолное,
	                               |	СправочникПартнеры.ОсновнойМенеджер КАК ОсновнойМенеджер,
	                               |	СправочникПартнеры.Поставщик КАК Поставщик,
	                               |	СправочникПартнеры.Перевозчик КАК Перевозчик,
	                               |	СправочникПартнеры.ПрочиеОтношения КАК ПрочиеОтношения,
	                               |	СправочникПартнеры.ДополнительныеРеквизиты.(
	                               |		Ссылка КАК Ссылка,
	                               |		НомерСтроки КАК НомерСтроки,
	                               |		Свойство КАК Свойство,
	                               |		Значение КАК Значение,
	                               |		ТекстоваяСтрока КАК ТекстоваяСтрока
	                               |	) КАК ДополнительныеРеквизиты,
	                               |	СправочникПартнеры.КонтактнаяИнформация.(
	                               |		Ссылка КАК Ссылка,
	                               |		НомерСтроки КАК НомерСтроки,
	                               |		Тип КАК Тип,
	                               |		Вид КАК Вид,
	                               |		Представление КАК Представление,
	                               |		ЗначенияПолей КАК ЗначенияПолей,
	                               |		Страна КАК Страна,
	                               |		Регион КАК Регион,
	                               |		Город КАК Город,
	                               |		АдресЭП КАК АдресЭП,
	                               |		ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	                               |		НомерТелефона КАК НомерТелефона,
	                               |		НомерТелефонаБезКодов КАК НомерТелефонаБезКодов
	                               |	) КАК КонтактнаяИнформация,
	                               |	КонтрагентыПереопределяемый.Ссылка КАК Контрагент,
	                               |	КонтрагентыПереопределяемый.ЮрФизЛицо КАК ЮрФизЛицо,
	                               |	ВЫБОР
	                               |		КОГДА КонтрагентыПереопределяемый.ОбособленноеПодразделение
	                               |			ТОГДА КонтрагентыПереопределяемый.ГоловнойКонтрагент
	                               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                               |	КОНЕЦ КАК ГоловнойКонтрагент,
	                               |	ВЫБОР
	                               |		КОГДА КонтрагентыПереопределяемый.ОбособленноеПодразделение
	                               |			ТОГДА &ПредставлениеОбособленногоПодразделения
	                               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(КонтрагентыПереопределяемый.ЮрФизЛицо)
	                               |	КОНЕЦ КАК ВидКонтрагента,
	                               |	КонтрагентыПереопределяемый.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	                               |	КонтрагентыПереопределяемый.ИНН КАК ИНН,
	                               |	НЕОПРЕДЕЛЕНО КАК КПП,
	                               |	НЕОПРЕДЕЛЕНО КАК КодПоОКПО,
	                               |	НЕОПРЕДЕЛЕНО КАК СостояниеПроверкиКонтрагента,
	                               |	3 КАК НомерКартинкиСостояниеПроверки,
	                               |	1 КАК ЭДО
	                               |ИЗ
	                               |	Справочник.Партнеры КАК СправочникПартнеры
	                               |		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыПереопределяемый
	                               |		ПО (КонтрагентыПереопределяемый.Партнер = СправочникПартнеры.Ссылка)}
	                               |ГДЕ
	                               |	ВЫБОР
	                               |			КОГДА НЕ &ОтборПоСегментуУстановлен
	                               |				ТОГДА ИСТИНА
	                               |			ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоСегменту)
	                               |		КОНЕЦ
	                               |	И ВЫБОР
	                               |			КОГДА НЕ &ОтборПоПолнотекстовомуПоискуУстановлен
	                               |				ТОГДА ИСТИНА
	                               |			ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоПолнотекстовомуПоиску)
	                               |		КОНЕЦ
	                               |	И ВЫБОР
	                               |			КОГДА НЕ &ОтборПоТоварнойКатегорииАктивен
	                               |				ТОГДА ИСТИНА
	                               |			ИНАЧЕ СправочникПартнеры.Ссылка В
	                               |					(ВЫБРАТЬ
	                               |						ОтборПоТоварнойКатегорииВТ.Контрагент КАК Контрагент
	                               |					ИЗ
	                               |						ОтборПоТоварнойКатегорииВТ КАК ОтборПоТоварнойКатегорииВТ)
	                               |		КОНЕЦ"
КонецПроцедуры
